{"Greeting": ["Hello", "How are you doing?", "Greetings!", "How do you do?"], "Apology": ["No problem"], "Thanks": ["No problem", "You're welcome"], "Goodbye": ["It was nice speaking to you", "See you later", "Speak soon!"], "10": ["We'll be sure to pass along your kind words!", "Our sincere apologies for any last minute gate changes, we know that's not fun. Please let us know if we can help here.", "Please have the customer reach out to us directly.", "Oh, Mark. We're so sorry for your loss.", "We're boarding now and we'll have you wheels up shortly!", "We're working on this and we'll get you to your family members with no problems. We look forward to having you on board.", "Thanks for visiting and chatting with us. Please come back anytime, Joel!", "She has a wealth of info to share!", "We always want you to receive top notch service and apologize for any web issues you're experiencing. How can we help you, Michael?", "You're welcome! We love being able to help when we can. Have a great flight.", "Please follow and DM your 6-letter record locator when you get a chance please.", "We're here if you need us, Robert. We don't want you to be frustrated.", "We're so glad to hear of a job well done! We'll be sure to pass it along.", "Woohoo, way to go Tom! We're thrilled to hear how rockin' he was and we'll share this with him and our", "We haven't received an update. We'll reach out to them directly and will DM you with a follow up. We appreciate your patience.", "Our apologies for this. No worries about this, our airport team will be happy to check you in.", "Our team is expected to remain professional and courteous at all times, our apologies for any rudeness you received."], "69": ["Our apologies for the delay in responding to you. Have you made it to LAX? Let us know if you still need assistance.", "Hi there! Our Reservations team can check on flights for you at 800-433-7300.", "You'll use our 6 letter record locator since the first leg of your trip is with us.", "You'd have to request the upgrade ahead of time so our agents can process the request for the upgrade.", "We've got your DMs and we'll respond there shortly!", "Our entire team is working diligently on this and we'll take excellent care of your son. We appreciate his service to our country!", "We fully expect to avoid cancellations, so at this time, we're not offering refunds or change fee waivers.", "We're getting our flights crewed and expect to avoid cancellations. We look forward to having you on board for your holiday trip.", "That's correct, Henry. They'll help you there.", "Please DM your record locator and we'll take a look for you, Faisal.", "Thanks for the heads up.", "We want to get you home too. Sorry for the wait tonight.", "It links you to our mobile website for easy booking, Chris. Thanks for your feedback on this.", "We're definitely here to help and if we can have a little fun at the same time, why not! This honestly made our day, Gary.", "We're here for you anytime you need us! Please feel free to tweet us anytime.", "We're so glad we could help turn this situation around! Have a fantastic morning.", "We're glad to hear our was great! We'll send more info about the Wi-Fi via DM.", "Oh, our apologies. We do our best to keep you together and we're sorry we couldn't.", "We'll be happy to take a look, Sven. Please meet us in DM with your record locator."], "21": ["We're sorry for your frustration.", "Hi, Matt, we've your info but we'd like to verify which trip you'd like to cancel. Please DM your record locator with the unwanted return.", "Thanks for the feedback. Here's some info on our Admiral's Club access, Heath. https://t.co/uvGag9kIry", "We're sorry for your disappointment, but please continue working with your insurance company for more information on your claim.", "We are working to resolve the issue and expect to avoid cancellations this holiday season.", "We do all possible to honor seat assignments. We're happy to take a peek. Please DM your record locator.", "We truly want every flight you take with us to be excellent and assure you our is prepared to take excellent care of you!", "We're happy to hear that, Brandella. We look forward to sharing the skies with you again soon!", "Rudeness is never tolerated, we're very sorry to hear this.", "We're sorry for the delay this morning, Dustin. It looks like the aircraft had a previous maintenance delay.", "We have a great selection of snacks, but we're always looking for great feedback. We'll be sure to share this with the right team.", "We've got our you make it. If you need help getting rebooked, meet us in DM with your record locator.", "So sorry your meeting was affected, Colleen. If you haven't already, you can apply for a refund here: https://t.co/xM8VkbQ07c", "We know your time is valuable and we're sorry you missed your meeting. We've rebooked you on the very next one at 3:36p.", "We'll take a peek. Meet us in DM with her record locator."], "4": ["We're glad you got to kick back and enjoy a show while flying! Thanks for your kind words.", "We love hearing this and look forward to welcoming you on board again soon.", "Sorry for the wait Carlye. We're working hard on getting your bag out to you.", "Way to rock it We're so happy to hear they could help with this sweet treat!", "Thanks for including us in your travel plans, Andy. Take the extra time to enjoy this beautiful day!", "Schedule changes may happen based on operational needs and fares are based on availability.", "We offer a variety of fares and our Reservations team is also happy to help search with you! https://t.co/iJWiiS4WLg", "It looks like we just pulled in and are good to go. Thanks for your patience.", "We're working hard to get you on your way. Let us now if you need any help getting rebooked.", "We're working diligently to address this issue and we'll take excellent care of you.", "We're currently working on a resolution, and fully expect to get everyone where they need to be for the holidays, Rachael.", "We're planning on an on-time departure and avoiding cancellations. We look forward to seeing you on board.", "We always want to keep you well informed. What's the flight number? We'll check the status.", "We fully expect to run a normal operation and avoid cancellations. We can't wait to fly you home for the holidays!", "Our pleasure.", "Please DM your record locator with details and a quick follow.", "We wanted more clarification and keep your information private. We're sorry for your disappointment.", "Irish passport, Mexican beer and American Airlines. We love the combination Have a great flight and weekend, Andrew!", "We know missing a flight can be frustrating, Sarah. Please work with our airport team for the next steps.", "We'll get everything sorted and have you on the plane ASAP.", "We appreciate the kind words. Sending best wishes your way. Family and friends are precious.", "You get to take that beauty We're so happy to have you flying with us today.", "Carry-on bags can be brought on as long as they're small enough to fit!", "Your connection was cancelled as an operational decision and our apologies that you're not home yet, Eric.", "Thanks for the great pic, Angela! It's always a pleasure having you fly the skies with us.", "Meet us in DM with your record locator if you need us to check rebooking options.", "That's great news and thanks for the update!", "We expect our team to be professional and courteous at all times, Nancy. We're so sorry you've had this experience.", "We'd be happy to look at options with you. Please meet us in DM or give our team a call via 800-433-7300."], "88": ["We never want your experience to be anything less than perfect. We're sorry the Wi-Fi was slower than expected.", "We're sorry for the wait tonight. We'll have you bags out to you as soon as possible. https://t.co/vpkBeWiqTq", "We expect our team to always provide the best service and we apologize for any rudeness. We'll be wheels up soon and have you on your way.", "We'd be happy to forward your comments to our folks in Central Baggage. Please move into DMs with your baggage reference number.", "We appreciate your feedback on the fares and service that we offer.", "Thank you for the feedback. Keeping the boarding process smooth and easy is always the plan.", "We appreciate your loyalty and we're sorry for the frustration this has caused, Troy.", "We'd like to verify. When you arrived in DFW, nothing was set out at your arrival gate?", "We can help. Please DM your 6 letter record locator, and KTN, as well as your date of birth. We'll get that added for you.", "There's no place like home! We hope our team makes you feel like family on board, Dale. Have a fantastic evening."], "60": ["Thanks for the shout-out and for stopping by, Marc! We'll pass this on to our SFO Admirals Club managers.", "We're truly sorry this has been your experience with us, as we always try to truly hear our customer feedback. We hope you remain loyal.", "Thanks for your kind words for Cynthia and Diane! We'll be sure to forward these along to their", "Do you have a description of the crewmember?", "Flights can vary, what day is this for?", "Our ticketing team has received your upgrade and they're working on it. An email will be sent shortly.", "Our routes and schedules are constantly changing. There's always a possibility!", "You're frustrated, we get it. In order for us to file a claim for possible reimbursement, we'll need to inspect your bag.", "They're truly a gem and we love having them in the fAAmily. We'll be sure to share this shout-out with them and our", "We appreciate your feedback on this and always work to make you feel welcomed.", "Thanks for your kind works!", "That is AAwesome. Have a great night.", "We'd be happy to look into this. Did you receive an email from our Customer Relations team? If so, DM the reference number.", "We're happy when you're happy!", "Yeah, no problem. We'll go ahead and meet you in DMs where it's not character restricted.", "Wow, that's high kudos, considering how much you fly! We'll be sure to pass along the kind words.", "There's a Club near gates A7-A9 that's right on the path to your connection. They should be able to show the gate.", "You've got us grinning from wing to wing! We're overjoyed by your kind words and we've passed them along for you.", "We appreciate your feedback, and assure you we're continuing to update our fleet as quickly as we can.", "Please reach our to our Baggage team at 800-866-4010 for any questions for reimbursement. We're so sorry for the delay.", "You can contact Reservations at 800-433-7300 or meet us in DM and we'll take a look.", "We're here for you. Please meet us in DM with your record locator and more information.", "We definitely want to provided exceptional service at all times. Please DM your locator and share how we can do better."], "50": ["They'll be more than happy to walk you through it and help with the booking process.", "It's still listed on your AAdvantage account. Is it not showing up on your reservation? If not, DM the number and your date of birth.", "We do have One-Day passes available at many locations, take a look: https://t.co/uvGag9kIry", "We've sent some info to you via DM. Please take a look when you get a moment.", "We let all of our customers know of any cancellations as far in advance as possible. Sign up here for updates: https://t.co/h88H9iXqqT", "The tickets have been issued. We'll share your ticket numbers for all 6 segments in DMs.", "We see the airport team has offered vouchers to help defray your dinner cost.", "How can we help, Annette? Meet us in DM with your record locator and more info.", "We're in the process of modernizing our entire fleet. We appreciate your patience during this time.", "We want you to be comfortable but we don't normally stock extra pillows. You're more than welcome to bring one on board with you."], "11": ["We're sorry for the long wait. The next available agent will be with you as soon as possible.", "Thanks for the info David. We'll pass this on to our team so she gets the recognition she deserves.", "Awesome, please DM the record locator of the person you're traveling with so we can rebook you guys at the same time.", "We love our military and are happy to help any day!", "We don't anticipate any cancellations at this time. You can sign up for notifications here: https://t.co/h88H9iXqqT", "We're happy to hear that, please let us know if there's anything we can do for you.", "It applies to 4 companions in the same reservation traveling within the 50 US, Canada, Puerto Rico and https://t.co/1iva8gJ6HM Islands.", "You may have 1-2 bag allowances but we'll need to check the ticket. You can look here for more info: https://t.co/XvGHnVVEv9", "We're already seeing resolutions. Thanks for the comments.", "What's their flight number? We see your DM and will respond there shortly.", "We feel the same way, you'll always be a part of our Cheers and have a great trip.", "We're happy when you're happy! Thanks for your kind words.", "We're sorry to hear this and thanks for reaching out to us. Please DM your record locator for a closer look.", "We're sorry for the extra travel time and know it's an inconvenience. We'd like to keep you flying with us and hope you'll reconsider.", "Please send your refund request via this link: https://t.co/xM8Vkc7BvM", "We're always happy to help when we can! We'll see you again real soon for another", "We're sorry your experience hasn't been all we want it to be, please let us know if there's anything we can help with via DM.", "We're sorry that you're having issues. Please try using a new browser.", "We appreciate your loyalty, Jason, and always want you to be treated excellent. We're so sorry you've had this experience.", "We're glad to be able to help you out, Katia."], "59": ["Fares sell in real time. We're sorry we weren't able to snag the lower fare for you.", "Oh my, that looks delish! Thanks for always sharing the good and the bad, Kevin.", "We try to upgrade as much as possible and will continue to do that. Our apologies that you haven't got upgraded as much as you'd like, Wael.", "We're sorry. Check with the consulate of the country you’re entering (or passing through) for your requirements. https://t.co/RtwK8VjCeh", "Gift cards cannot be used for purchasing seats, our apologies for any inconvenience.", "We'll be in the air soon and our team will do all they can to make up the time in the skies.", "We love making your entire experience the best and we're sad to hear you feel otherwise.", "Please DM your record locator and we'll go over more info for you.", "You're very welcome!", "Thanks, James! Happy to fly with you and we definitely appreciate the kind words. Happy Thanksgiving!", "You've got the place to yourself, Ramsey. Sit back, relax, and enjoy the quiet for a bit.", "Way to go, Sally and Tina! We'll be sure to pass along the kudos, Sam.", "We're thrilled to have you on board Andrew!", "That's not the impression we want you to have. What happened? Please let us know if we can help.", "Schedule changes can happen at anytime, Joe, but we do notify you of them and if adjustments need to be made, we're here to help."], "74": ["We're glad our Reservations team was able to help.", "We're glad that our team was able to help. Have a fantastic evening!", "Andres, we know your time is valuable and we're so sorry for the late start this morning.", "If you send a DM our way with the reservation details, we can check on the upgrade options for you.", "We know you're ready to be on your way, Antoinette. What's your flight number, we'll check on an update?", "We're sorry for the delay. We do our best to keep our departures on time.", "One of our specialists will be in touch with you in the upcoming days in regards to this flight.", "We see you should be in the air very shortly and our team will be making up time so your delay will be minimal.", "We do all possible to avoid delays. Our apologies that your travel has been affected.", "We're here to help if we can. Please meet us in DM and we can take a look for you."], "54": ["An airport agent will be happy to take a look at your bag to assist with a claim but damage must be assessed in person.", "We're sorry for your delay. We can take a closer look at the situation, please DM your record locator.", "We should have agents available to guide you on your rebooking options. Please DM your record locator and we'll take a peek.", "We're thrilled you're enjoying the flicks on your flight!", "If an instrument fits into the overhead bin or underneath the seat, then customers may choose to bring this as their carry-on.", "We do like to shine for you, Gary. We're sorry for the wait. Let us know if you need any help. We're here for you.", "It was a pleasure seeing you on board and we can't wait to see you again!", "We’re working to address this issue. We do expect to avoid cancellations this holiday season.", "Please follow and DM your record locator and we'll take a look.", "Give our Reservations team a call to help with booking. Here's a list of numbers: https://t.co/Y3rvFiW5bQ", "It's our goal to still operate as scheduled. If there's a change to our schedule we'll contact you. https://t.co/h88H9iXqqT", "We do our best to avoid delays, but safety is our top priority. We'll have you wheels up just as quickly as we can!", "We want all of our customers to get where they need to be this holiday season. We're expecting to avoid cancellations.", "Happy Thanksgiving to one of best and favorite customers! We appreciate you very much.", "Please reach out to our baggage team to file a claim so we can get you reunited soon. https://t.co/zSdeH87Yqc", "What a fantastic Thanks for sharing the view from your window.", "Sometimes stowage space may have filled but our team will definitely have your luggage returned upon arrival.", "It's another fantastic day at We had an excellent Thanksgiving, and we wish that you did as well. We'll talk soon, Tim!", "We know this is upsetting. We're working on having our catering out of LAX back to normal.", "Any of our agents can point you in the right direction.", "Welcome aboard today and there's a lot to do at the airport during your layover, Erin!", "We're glad to see you've pulled out of the gate. We'll have you wheels up in no time!", "We understand and we appreciate this info.", "The seat charge will be refunded back to the original form of payment for you. We look forward to seeing you for your return.", "We do everything possible to keep from canceling a flight but we're always here to help if you need it.", "Since you're automatically upgraded, when you have a companion with you the reservation has to be split out. You can opt out of upgrading.", "We're working hard to update our fleet, Erin. We can't wait for you to check out one of our newer birds.", "We always want to keep you with your bags and we're so sorry for the inconvenience.", "Way to go Dawood! We'd love to share this with his managers. Please DM your record locator and we'll send it right over.", "We'd like a bit more info, please follow and DM the record locator with additional details."], "3": ["We're happy when you're happy! That sure does look delicious.", "The experience of our most loyal customers is paramount. We're installing a new type of much faster Wi-Fi on much of our fleet.", "Please DM us the details of your experience.", "If you pull up that link, it does say that elite and eligible Citibank customers are exempt.", "Please follow and DM your record locator, Peter. We'll forward your comments to our team to get that fixed.", "Please DM your record locator. We'd like to take a closer look.", "We care for all of our customers and we invite you to share more info along with your record locator via DM.", "Funny how our Spidey senses tingle at initial descent!", "We're glad the yummy offerings were within your dietary needs, Elizabeth. Enjoy!", "What's going on, how can we help?"], "39": ["We'd like to share this feedback. Please DM your record locator.", "We're sorry for the delayed start to your honeymoon. Let us know if you need help with rebooking and we'll take a look.", "What a great seatmate! We hope you have a great day, Christena.", "Wow, your is B-E-AA-UTIFUL!", "We'd love to help if we could, but we don't have that option. Please continue working with our baggage team for reimbursement options.", "As of now, flights are scheduled and we expect to avoid cancellations.", "We're expecting to avoid cancellations, Clint. You're always able to check the status of your flight here, https://t.co/h88H9iXqqT.", "We're operating as scheduled to get everyone to their holiday destinations. If it changes, we'll let you know. https://t.co/h88H9iXqqT", "All information regarding our oneworld carriers can be found on their website. We're sorry for any inconveniences.", "We see our airport team has you rebooked with confirmed upgrades on later flights. Our apologies for any inconvenience caused.", "This flight is operated by Japan Airlines and is airborne now. We're unable to do anything at this point.", "We want you to be comfy so please check with an attendant about other possible options, like Main Cabin Extra: https://t.co/N9kHMrvr7b", "We do our best to guarantee seats and we're sorry yours were changed. Please DM your locator and we'll take a look with you.", "It's going to be a fun ride!"], "0": ["Your guitar must fit underneath the seat in front of you or in an overhead bin. Please see details here: https://t.co/AqqDo7qAE3.", "Thanks, Daniel. We've got a great going on!", "We're thrilled to start off November with you Noemi!", "We'll make sure to take care of your things. When you land, we'll have it waiting for you.", "You captured a great pic! Thanks for sharing.", "What a cutie pie!", "If free seats are no longer available, our airport team is happy to assist in assigning one the day.", "We have several purchase options. Please check here: https://t.co/O6Fdx4Pk6T and let us know if you have any questions.", "It was a pleasure being your ride through the skies!", "We expect our team members to be kind and courteous. If you experienced any rudeness we truly apologize.", "Those seats will be complimentary at the gate. Our team reserve the best one available upon arrival. We look forward to seeing you soon!", "We plan to avoid cancellations.", "We're working hard to address the issue. Since we have no plans on cancelling flights, we're not authorizing refunds at this time.", "We'd like to share your comments with our specialists for review and follow-up with you directly. Please DM your record locator.", "Is there a specific flight you're wondering about? If so, please share the date and flight number and we'll take a look.", "Our team will take great care of you and we expect a full operation. We look forward to having you on board!", "Please follow and DM your record locator, Thomas. We'd like let our App Team know.", "We're always looking at new routes. Keep an eye out for any changes.", "We love providing excellent service to our greatest flyers and we're glad we get to spend the day with you!", "Fabulous indeed!", "To see what is currently showing on our flights, click here https://t.co/DrKXzwRGJN", "Thanks so much for taking the time to send us your very kind words!", "Happy Thanksgiving, Amanda! Thanks for the amazing shout-out!", "We'd need you to DM your record locator for this, follow us and let us know once you have. We'll DM you once you do that.", "We have fares that allow access to the overhead bin space. Please check them out here: https://t.co/iJWiiS4WLg", "We're thrilled to have you both Have a fantastic morning.", "We know that communication is key and we truly apologize for this.", "We're playing these beats just for you! Thanks for flying with us today.", "Please follow and meet us in DMs with your record locator and we'll be happy to take a peek.", "Our gate agents aren't equipped to take money, Jeremy. Which flight are you confirmed for?", "We're glad to help where we can.", "We love spoiling you, Chuck and we're glad you're on board with us today. Have a great time sitting", "We have an ETD of 4:45p. Thanks for your patience while we get everything safe to fly.", "What's going on? We're here for you.", "Prices can vary based on the booking date and availability of seats. Please check online or call Reservations at 800-433-7300.", "Oops, we got so excited about the game that our fingers slipped. We're looking forward to seeing your kids on board in 2018.", "We know you like to stay connected while on board. Please share your feedback with our friends", "We're sorry for the interruptions to your sleep and we hope you were able to get some more on board.", "Enjoying the view?", "What's going on?", "Purchasing Main Cabin Extra or Preferred seats is an option offered in advance. Seats will be assigned once you arrive to the airport!", "We would if we could, Luis.", "We'd love to have you both with us together soon!", "Wow. We must agree, absolutely", "We can't wait to see you on board. We're showing some of our flights that are operating in November are 738 and AB319.", "Hola, Ana! Please DM your record locator so can take a look to check options for you.", "We value your loyalty and feedback, Adam. We'll pass your comments to our leadership team.", "It's the small things that sure make a difference! Happy you're enjoying your full can of ginger ale.", "We're looking forward to seeing you on board!", "We try to offer a variety of foods, to appeal to a variety of palates. We do hope there was something else you were able to enjoy.", "If there's a new reservation you need assistance with, please let us know via DM."], "27": ["Please share your record locator via DMs and we can take look.", "Our offer to help via DM still stands. Please have her reach us there.", "We're very sorry for this experience. If we can help with an update, then please share your flight number.", "We appreciate the kudos, Julie. We're always here for you", "Fares are based on availability too, so you may have to be flexible if all the lower ones are sold out already.", "We've flexible fares that allow changes to be made without a charge for situations like these. So sorry for any inconvenience this caused.", "Are there any open seats you could be moved to?", "Fares are based on availability and we'd love to see you on board. Please check with on our site or with our team for the best fare options.", "We'd like to take a look into this. DM your AAdvantage number and more info.", "We've got a current 5p departure time and we're working hard to get you on your way. Once you arrive in LAX, please follow-up in DM.", "We're truly sorry for the delays today. We'll have you on your way as soon as possible.", "You're very important to us but we have to stay consistent with our policy. If the name is misspelled, we can help with that.", "Please DM your record locator and we'll take a look.", "We understand the frustration but our team will have you on your way as soon as possible. We truly appreciate your patience.", "We'll see what we can find our. Please DM your record locator or the flight number, date of travel and name on the ticket.", "Hi Woody. We're here 24/7 via Twitter is you ever need assistance.", "Awesome, we need more youth advocates in the world. Please make a formal request with us here: https://t.co/CINjMy4zPE", "We received your flight details via DM. We'll respond shortly, Zach.", "Please take a look at your DMs for a message.", "Our team does their best to get you seated together. Maybe someone on board will be willing to move so you can.", "We'd be happy to help with available options. Please DM your record locator, if we can help.", "If you purchase the ticket via a 3rd party, they'll need to make any name changes to the ticket.", "Take a look here for more info: https://t.co/kNkPUilgez"], "52": ["Did you file a report with us? If you did, please send us a DM and include that in so we can take a look.", "Our service should be consistent all across the board, Stuart. So sorry if you experienced otherwise.", "Our fleet is getting younger, and younger by the day. Keep an eye out for the exciting changes that are to come.", "We're showing it left 25 min after it's original departure time. Please see an agent for rebooking options.", "Please speak with the final carrier on any reimbursement options.", "Waiting around is never fun, our team will have you on your way just as quickly as they can.", "We're here to help, Leslie. What's going on?", "We've the best crews in the biz, Ahmed! We always want everyone to feel special.", "Thanks, Patricia!", "We're sorry for your disappointment. It's for this reason alone that we always suggest to our customers that they purchase trip insurance.", "We have the best pilots around! Now you have a little extra time to get where you need to be.", "We're sorry for the wait, Mary. Our ground team is working to get everyone's bag off the flight and reunited to you as quickly as they can.", "Thanks for the shout-out, Stacey. We're glad our team helped save the day. Have an AAwesome flight!", "Our apologies for the wait, our team will have them to you as soon as possible, We appreciate your patience.", "It is a very busy holiday season, everyone has somewhere they'd like to be!", "We always want you to have options so if you find a ticket that's equal mileage, our agents could always look into reissuing your ticket.", "We agree communication is key, and appreciate the feedback you provide.", "Wow, what a pretty", "You sound frustrated after your call. Please let us know how we can be of assistance.", "Our apologies for the longer than normal hold time. We're here to help if we can.", "If your connection is missed, we have you packed up on the next flight to Miami to make your international flight.", "David, we hear you and are here to help. Please meet us in DMs and provide your info so we can try to assist.", "We're counting down the days until we see you, Ruben!", "American Airlines does not tolerate discrimination of any kind. Please DM your record locator and details so we can look into this.", "We have your DMs and will answer you there, Jasmine.", "Thanks for your patience, Doug. We see you've pushed back from the gate and will be in the air and on your way shortly.", "We always want you to enjoy your flights with us, James. We hope you'll remain loyal as we continue updating our fleet.", "What can we say? Only the best for you, Max.", "Phenomenal, what a fantastic way to describe our Thanks for your kind words, we'll pass along your feedback.", "Aww, that's a sight for sore eyes! Glad you could see your mom.", "Consistency is key and we always want to keep you with your bag when possible, our apologies."], "42": ["We hear you, Liam. We're working as fast as we can to update our fleet and will soon have super fast Wi-Fi to stream movies.", "Refunds would have to be handled by the team. We're again very sorry for this experience.", "Early morning bird! Thanks for visiting the Club, have an excellent flight.", "If you were on a Basic Economy ticket your bag still has to make the cut off time for bags.", "We're doing everything we can to maintain flights. You can sign up for notifications here: https://t.co/h88H9iXqqT", "If you send us a DM with your bag tag number, we can take a look. You can also give our Baggage team a call via 800-535-5225.", "We know being delayed can be frustrating. We'll get this taken care of quickly and get you headed out. Thanks for your patience.", "If we're not able to resolve this issue in a timely manner, we'll provide more info with available options. Thanks for your patience.", "It was our pleasure and first have a fantastic weekend. See you on Monday!", "You would need to file a claim with the carrier that took you to the final destination. They will work behind the scenes with other carriers", "Your carry-on can't exceed 22 x 14 x 9 inches, Vicky.", "Please provide any supporting documents via DMs and we'll gladly take a look at this.", "She sounds like a gem! We'll send this along to our leadership team.", "Good morning! *waves intensely*", "We wanted you to have a nice and comfy ride and sorry to hear your experience was otherwise.", "Your Basic Economy fare allows you one personal item on board. We'll get your laptop to you just as fast as we can.", "Thanks for hanging in there with us when Mother Nature decides to play.", "It depends on the type of ticket you purchased. Please DM your record locator.", "Some flights may not have space overhead and you'll need to check it. We'll get it back to you when you land."], "73": ["We appreciate your feedback!", "Prices can change very quickly. They're based on availability.", "We'll be more than happy to give them your thanks!", "Our airport team is working on this. Thanks for your continued patience.", "You're welcome, please be sure to let our crew know if there's anything they can do to help make your ride more comfy!", "What's your flight number this morning? We'll take a look.", "We're so sorry that the seat was broken. Did you inform our flight crew for a possible seat change?", "We're happy to help and can't wait to see you!", "We love all of our pilots! Thanks for flying with us.", "Happy Thanksgiving, Kisha! We're glad you were on board with us today. Thanks for choosing to fly with us.", "It's just something we offered and so we wanted to share it with you, our apologies if we've upset you.", "We love to be able to keep our customers in during the holidays. Enjoy!", "You both look very comfy today and we're glad you were able to catch some on board!", "We appreciate your feedback, Christopher. It'll take you over to our mobile site when you're trying to book any type of ticket.", "We've got the best in the business and we're always happy to take excellent care of you. Thanks for the kudos for our", "Award travel is handled a bit differently. The same inventory would need to be available to rebook for a new flight.", "We know this is an uncomfortable situation but safety is our top priority. Our maintenance team will have you on your way soon.", "We're always here and just a tweet away!"], "56": ["Thanks for your kind words! We hope you have a fantastic evening.", "She sure is a gorgeous bird!", "Yes, and thank you for the support! We’re working hard to ensure we get our customers to where they need to go over the holidays.", "We are working to resolve the issue, David. We expect to avoid cancellations this holiday season.", "Way to go Deborah! We'd love to pass this along to her and our please following in DM with more details.", "She's pretty", "Sounds like you found the", "Please ensure you speak with our team before leaving the airport to set up a report: https://t.co/Lts67cwTlN", "We'll be more than happy to reach out to the right team about this. Please meet us in DM with more personal info and record locator.", "We're happy to provide an explanation. Please send us your flight details so we can take a closer look.", "Thanks for your kind words for our We'll be sure to forward this along.", "We offer different ways for our customers to check-in. Sometimes our agents may take longer and we don't want our customers to wait.", "We're so glad you're being reunited! Thanks for joining us on board.", "What? You should've at the very least 4 inches extra of leg room. Please DM your record locator so we can take a peek.", "Way to go We're happy to hear they took such care of you.", "We gauge overhead space the best we can and we're sorry you had to check your bag.", "We've received your DMs and responded.", "We'd like to pass this info on to review internally. Meet us in DM with your record locator.", "Awesome. We'll take a peek at your fabulous shout out for the", "Your trip with us should always be great. We're so sorry for any issues you've experienced.", "You bet!"], "89": ["That's the most current info, but if there is any further update our gate team will provide it as it becomes available.", "Oh my, we'd like to have more details about what happened. We always expect our team to treat our customers courteously and friendly.", "We see you're all board now, Scott. We'll have wheels up very soon.", "It's going to be a really tight connection, unless we're able to make up time in the air. You're backed up also on flight 1501 at 12:49p.", "Delays are frustrating we know. We're showing an updated departure time of 8:10a. We'll have wheels up as soon as we can.", "We strive to provide a seamless travel experience and apologize if that wasn't your experience. Please DM your record locator.", "We're very sorry for this situation. If we can help with rebooking options, then please let us know.", "Check in needs to be complete at least 45 minutes prior to departure. Please see an agent for assistance.", "Please follow and DM us with your mom's Customer Relations file number so we can take a closer look.", "We'll get our crew complete as soon as we can. We should be headed out at 8:15a. Thanks for waiting.", "We look forward to seeing you on board!", "We're working on this issue and expect to avoid canceling flights.", "We're working diligently to resolve this issue and expect to avoid cancellations, Gary.", "We're sorry to hear that, Kate. We do try to keep changes to a minimum. Please DM us your record locator if you need help with it.", "Schedules changes can happen as a regular part of all air travel. Our apology for any inconvenience caused.", "Happy Thanksgiving! We hope you and your family had a wonderful time together.", "We'll take great care of you on board. Thanks for joining us.", "We're very sorry for the extra travel time, and the frustration you faced. Your feedback helps us improve.", "You're able to text using Wi-Fi but not thru regular text messages with a carrier.", "We know having your bag is important, please make sure you file a claim with our team before you leave the airport.", "They can be brought into an AA ticket counter for payment as well.", "That's a little on the unusual side. It's just a great way for our passengers to build additional miles.", "We'd like to pass your comments along to our team, Alex. Please meet us in DM with your record locator.", "Do you have anymore details that you can provide us with? Please DM her six letter record locator."], "37": ["Looks like it has a maintenance delay and it's currently scheduled to take off at 10:10p.", "You wouldn't get those perks on BA, Martin.", "We always want to be consistent when it comes to your carry-on bag and we're sorry it had to be checked. We invite you to DM more details.", "There's a baggage cut-off time that's followed in order for your bags to make the flight. If you miss this time you'll need to rebook.", "We'd like to share this with our App team, Jenn. Please DM your record locator, what version you're using and your phone type.", "We're still planning on flying as scheduled and expect to avoid cancellations.", "We haven't canceled any flights at this time. So you won't see any info on your flight other than the scheduled departure info.", "That's great news, Tina! We always want to have you up front with us.", "Our gate team was informed about what was happening at TSA and held the flight. We're happy you made it!", "You're very welcome, Caroline. Our flight crew is there to take care of you!", "It sounds like you purchased a Basic Economy ticket and our gate reader makes us aware. Here's more info: https://t.co/MKvFFVWJdz", "They should be able to book it for you if needed. Please give them a call back.", "This was divided on the 30th at the airport, please meet us in DM so we may go over this with you further.", "We always want to keep you aware of what's going on, our apologies.", "You can reach our Baggage team at 800-535-5225. If you have your claim number, you can track it here: https://t.co/CWhl8tcyzH"], "30": ["Our crew is there to serve you and not deceive you in any way. We're also here to help so please share your flight details via DMs.", "We know it's important to get you where you need to be. We're truly sorry for the change to your plans.", "We do offer hummus for purchase, Darcy. We're always looking to improve our choices and quality in food selection.", "We'll take great care of you and thanks for giving us another opportunity. Please set up a notification here: https://t.co/h88H9iXqqT", "Yes, Tony. your bags will be transferred. You'll check them in IAH and will pick them up in YVR.", "As of now, we fully expect to avoid cancellations. If that changes though, we'll notify you as quickly as we can.", "She's a beauty and we're looking forward to having you on board soon!", "We're a little confused why you're being charged for an infant on the lap. If you'd like for us to take a peek, DM your record locator.", "We should have you parked any time now, Rose. Have a great Friday!", "Please have your friend reach out to our Baggage Services. He can contact them at 800-535-5225.", "We appreciate the feedback on how we can improve your experience.", "It's important to us to keep you and your honey close together. Please see our airport team about getting on a list for upgrade.", "We hear you, Ray. We're very sorry for the frustration this has caused you.", "There was a delay with the bag loading, we're showing a departure time of 7:45p. Thanks for your patience.", "We're happy to hear you love them just as much as we do!", "Treat yo self, Will. Always great to have you on board.", "We'll have you at your gate and on your way as soon as we can. Thanks for your patience.", "What's your flight number? We'd like to check for an update for you.", "We can think of some others we'd prefer to watch on a flight. We'll save Final Destination for when we're on our own couch.", "We'd love to have you on board. Keep an eye on https://t.co/rZn1O8tOMy for options!", "If you're paying for the whole trip, it can be done at either time. If only one part, it's collected on day of departure.", "All travel must be completed within one year from the day the ticket was issued.", "There are different rules for different areas such as Mexico versus Europe or Asia. We're happy to look at your reservation via DM.", "Thanks so much for the shout-out to Jose in Miami! We'll be sure to send this for him."], "8": ["Our offer still stands to assist, Andrew.", "We can take a closer look. Please DM your record locator and details.", "Our fleet is getting younger everyday, soon all of our plane will have outlets.", "We're closely working with the airport and monitoring conditions, Joe. We look forward to operating more flights in and out of SJU.", "We're doing everything we can to avoid cancellations. You can sign up for notifications here: https://t.co/h88H9iXqqT", "Doors close 10 minutes prior to help ensure an on-time departure. Please give us a call via 800-433-7300 for help rebooking.", "We're working diligently to address the issue and fully expect to avoid cancellations.", "We have some of the best in the business, for sure, Lori!", "We fully expect to avoid cancellations, Jo. If that changes, we'll notify our customers as quickly as possible.", "We're sorry for any last minute changes you had while traveling over the holidays. We fully expect to avoid cancellations over Christmas.", "We're sorry to hear that your flight wasn't enjoyable but glad you enjoyed the tunes. If we can help in any way let us know.", "We're sorry for the wait. Our team is working to get you as soon as possible.", "We know having a spot for your bag near you is important, however the overhead bin space is available for everyone to use.", "We see we responded to you on Facebook. Our apologies for any frustration this caused you.", "We've saved you a seat on AA3261 at 9:50p this evening. Our apologies for the delay.", "Our team is doing everything possible to get your flight in the air. We appreciate your patience.", "This isn't the kind of shout out we like to get. What happened to cause your disappointment?"], "80": ["We're sorry for the delay. The previous pilot may not have been aware of the problem. We appreciate your patience.", "Vegas here we come!", "We're sorry we weren't able to keep your original seat. Please check with our crew for any other available options.", "We're sorry for the extra tarmac time, Brent. We'll have you on your way just as quickly as we can!", "Basic Economy tickets do come with more restrictions than Main Cabin. Here's more info: https://t.co/MKvFFVWJdz", "We've replied to your DM.", "The safety of our customers are always our number one priority. Please provide us with your record locator and more details.", "We'd love to see you. Check out some info about our planes at: https://t.co/Cqtk8kHZip", "It's might be a little gray outside, but on-time arrivals always brighten our morning!", "Thanks for the nice applause to our in Boston!", "Schedule changes may happen based on operational needs, we can take a look at your reservation with you via DM.", "Please give our website wizards a call to help work though the booking. 800-222-2377", "Consistent service is what we want you to receive. Please DM your record locator and we can pass on your comments for internal review.", "We appreciate your feedback and will be sure to share it with our folks in Catering.", "We'd like to help and check on seating and other flight times for you! Please send your record locator via DM with follow."], "86": ["Please DM your record locator, we'd like to forward this feedback.", "Our apologies for the late start. We'll get our crew complete and get you going soon.", "The departure has been updated to 7:45a. We'll get you headed out soon.", "We can give it a try, Katrina. Please have her send a DM our way with her flight information.", "What's going on exactly? Meet us in DM with your record locator and more info.", "We care for all of our military men and women and we'd like a bit more info. Please follow and DM additional details.", "As of now, we're operating as scheduled. We expect to avoid cancellations this holiday season.", "Our team will take excellent care of you and we expect to avoid cancellations this holiday season.", "We understand you're concerned and assure you we're diligently addressing the issue and fully expect to avoid cancellations.", "You can set up notifications for your flight here: https://t.co/h88H9iXqqT", "The holiday season is a very important time for travel and we have every intention on operating flights on schedule.", "We want to keep families flying this holiday season and fully expect to avoid cancellations, Cora.", "We don't ever want to get in the way of your holiday and our crew will have you on your way ASAP. Thanks a lot for your patience.", "Also known as a skypunch! Super cool and even cooler to be viewed from 35,000 ft. up.", "Some destinations have a box embargo but take a look here for more information: https://t.co/XvGHnVVEv9", "Oh really? Where are your taking us this time?", "Yay! We look forward to showing you a really great time.", "Way to go Jodi! DM your record locator so we can pass this on to our", "Please try changing your font and text size back to the default settings. We're working on a fix for this.", "We hope you get to cross another plane off your", "We're having a specialist review this for you, Fred. They'll be in contact directly soon.", "We're so sorry for the longer than normal wait time, Tony. We hope you'll give us another chance.", "The safety of our customers and crew is our top priority. We're so sorry your vacation has been affected."], "29": ["We see you're arriving just a few minutes early, we're always working to get you to your destination as soon as possible.", "Welcome to Dallas! Come fly with us again soon.", "Meena is an Please DM your record locator, we'd love to forward your praises.", "If you cancel your reservation now, all fare rules will apply. You're welcome to DM your record locator and we'll look at it with you.", "Our Maintenance team is working hard to have you in the air as quickly as possible. Thanks for hanging in there with us!", "If there aren't seats available you won't be able to purchase. We hope you find something that works for you.", "Thanks for getting back with us and we apologize again for the inconvenience. Please meet us in DM for more information.", "We're working to resolve the issue. We don't expect to cancel flights during the holidays season.", "We'll be wheels up as quickly as we can and on our way! What's your flight number?", "If there are changes to the flight we'll reaccommodate you on the next available flight.", "We're looking forward to sharing the skies with them for the first time! You're always welcome to let our crew know the day of.", "If you DM your record locator, then we'd be happy to take a closer look.", "Our crew will have you deplaned as soon as they receive gate clearance!", "What's your flight number and we'll take a peek?", "You betcha, Toby. We live for these AAdventures with you!", "It's our goal to get you on your way as close to schedule as possible. Thanks for your patience.", "sorry for the wait tonight. We always want to get you on your way as quickly as we can.", "We're in a race and we're winning!", "If your flights have been changed by more than 61 min, then yes, you can cancel and request a full refund here: https://t.co/xM8Vkc7BvM"], "62": ["Thanks for your loyalty! It means the world to us.", "We're so glad to be your airline, Ross! Thanks for your loyalty.", "What a coincidence, you're our fAAvorite too! Have a great flight!", "Paid seats are an option, never a requirement. We can always take a look at your reservation via DM.", "Anytime, Tony. We're here to help.", "You can always sign up for notifications. Closer to date of travel, you can be notified. click here for info https://t.co/OtDaH7XmLN", "That’s so awesome and we’d love to share this with Christy. Please DM your record locator and tell us where she helped you from.", "You've purchased a non-refundable ticket that has a change charge. You can find out more details here: https://t.co/CXTP5RPBiZ", "We don't have that information on our end but if you speak with an agent, they'll request a supervisor for you.", "We don't ever want any surprises and it sounds like you had a Basic Economy ticket. Take a look here for more info: https://t.co/MKvFFVWJdz", "Thanks for letting us know, Ashley! We're always here for you, 24/7.", "We know your time is valuable and our apologies you were rerouted, Stephan.", "The email can take a bit to deliver but DM the locator and we'll take a look.", "Our team looks for certain availability when using your miles. If you want a direct flight, there may be other awards open using more miles.", "That's what we're here for, Amanda! Tweet us if you need us.", "We don't want you to feel like this, Cadence. Please let our crewmember know, we can possibly move you to another seat.", "The vouchers can also be brought in to a ticketing location to be turned in. As soon as we get them, we can issue the tickets.", "We feel your frustration and we're sorry we've upset you. We'll get everyone on and wheels up as quickly as we can.", "We're looking into your DM right now and will respond there shortly.", "We're glad you were able to get someone to help. Please remember, we're just a tweet away.", "Unless you're in Basic Economy, you're allowed a personal item under the seat and a carry-on in the overhead."], "85": ["We apologize for the inconvenience. Travelers submit their paperwork to us, but aren't required to show it to everyone on board.", "We know you're ready to stretch out. We offer Main Cabin Extra, with more leg room: https://t.co/N9kHMrvr7b", "We're doing everything we can to avoid cancellations. You can sign up for notifications here: https://t.co/h88H9iXqqT", "Happy Holidays!", "We want to get our customers where they need to be and we expect to avoid cancellations this holiday season.", "We're still operating our holiday travel schedule as normal and expect to avoid cancellations.", "We're here for you, please meet us in DM.", "You're welcome! We're here if you need us.", "Yes, we do allow laptops on board for domestic flights.", "We want all of our customers to get where they need to be this holiday season. We’re expecting to avoid cancellations.", "We're excited just as much as you're, what an adventure to come. Best wishes and happy holidays!", "We've received your DM and will follow-up with you there shortly.", "You're welcome!", "We're thankful having you being part of the", "From our family to yours, Happy Thanksgiving!", "Happy Thanksgiving! We've replied to your DM, please take a look.", "Our PHX Team really appreciates We know they are to your family!", "Yes, perfect! We'll respond in a direct message shortly.", "Nice kicks! We love when you get upgraded.", "You bet.", "We're glad you found a favorite to enjoy!", "We'll get back to you when we receive it."], "46": ["Any dogs you see outside of a kennel are either service or emotional support animals.", "It sounds like you had a Basic Economy ticket. You're only able to have one personal item underneath the seat when you have this ticket type", "Our sincere apologies for any rudeness. We welcome all families to fly with us and want this to be an exciting experience for your kids.", "We'd like more info to see if we can help. Please DM your bag file number.", "You sure got us to chuckle! We're loving your even if the sun is hiding.", "We've partnered with the Red Cross to provide assistance. Please reach out to them directly to see how you can help.", "We appreciate your patience and we're glad to see you're off and on your way.", "We’re working to address this issue and completely expect to avoid cancellations this holiday season.", "We know it's been a long travel day and glad to see you're on your way now. You're set to arrive in BOS at 3:20pm.", "While our crew does require space to stow their items, we truly do apologize for this experience. Please DM your record locator.", "If you're no longer going to travel with us. Please let our team know and request a refund here: https://t.co/xM8Vkc7BvM", "Way to go Meet us in DM with your record locator so we can pass this along.", "Please DM your record locator and details. We can check on it for you.", "Thanks for providing feedback on this. We're always working towards improved experiences for our customers.", "So sorry to hear that's happened, Caitlin. Have you tried seeing if you can make the change on our website? If not, please try again.", "It's a parent's option to use the minor escort program once your child reaches 15. No one knows your baby better than mom and dad.", "We want to provide you with the best service we can offer. We're so sorry that you're disappointed.", "We're providing waivers for St Croix, Gillian. Please take a look at our Travel Alert for STX here: https://t.co/kNkPUiCR67."], "83": ["We're sorry for the inconvenience, Nick. Did you ask a crew member if you could move to another seat?", "It looks like there's a maintenance delay and we've an estimated departure time of 10:40p. We'll get you in the air soon, Bennett.", "Aren't they the best?! Glad you had such a great flight, April. Come see us again soon!", "We're very sorry for any rudeness, Nicholas. We always want your experience with our team to be great.", "We are working diligently to address the issue and expect to avoid cancellations this holiday season.", "We couldn't agree with you more! We're happy to start our day of right with you on board.", "We're working diligently to address the issue and expect to avoid cancellations. You can create notifications here: https://t.co/OtDaH7XmLN", "We count on our agents to always be professional and courteous, Andre. We'll be sure to forward your comments to our flight services.", "We've had a few pilots volunteer from the Nathan. We'll be good to go for the holidays.", "Our team is working to get things squared away and you on your way ASAP.", "We need your name, record locator or AAdvantage number to further assist you.", "We don't have the powers to provide free upgrades. Give our team a call to go over possible upgrade options via 800-433-7300.", "We're glad to hear that you enjoyed it and we appreciate your feedback.", "Our fares are based on availability. You can find best prices here: https://t.co/iJWiiS4WLg.", "If you need some help with your travels, we're here to help.", "Our team is expected to be courteous and respectful at all times. We're sorry if this wasn't the case.", "We know you're ready to get your bags and go. Thanks for hanging in there with us, Montero.", "We always expect our team to be professional, and we're sorry if you experienced. We'll be sure to forward along your feedback.", "We're truly sorry the delay caused the missed meeting. We're not able to offer anything further however.", "That's awesome! We love staying connected with you at 35k feet in the air. Let us know if you need any help, we'll be right here.", "We always want you comfy on board, we do offer Main Cabin Extra seats which allow more legroom: https://t.co/N9kHMrvr7b", "We'd love to share this with them, meet us in DM with your record locator and we'll pass it along.", "Our apologies for any issues, Michael. In cases of paper vouchers you do either have to mail the voucher, or bring it to the airport.", "Congrats to that! And you never know, check out our Careers page, we'd love to have you in the fAAmily! https://t.co/n0sFQy7p25", "We're sorry for any rudeness this morning. Let us know if you need our help!"], "58": ["We're glad that our team was able to help, but we appreciate this feedback.", "Width can vary just slightly throughout the cabin. Main Cabin Extra seats always have 4-6 inches of extra legroom.", "We do our best to keep you in the loop and apologize for your delay and lack of communication. We should be airborne soon!", "If a customer needs a little extra time to board please have them speak with our gate team immediately.", "We plan on operating as scheduled. If there are changes, we'll let you know as quickly as we can.", "We're expecting to run a normal schedule with on time departures. You can sign up to receive notifications here: https://t.co/OtDaH7XmLN", "Every agent should be kind and courteous, Lisa and we're sorry if that wasn't your experience. We're here for you, if needed.", "Reservations must be used in the sequence that they're purchased or the ticket must be reissued.", "We count on our team members to always greet our customers with a smile and be courteous, Amanda.", "We're truly sorry we missed your visit with us, Shawn. Hope to see you again in the near future.", "Our team always fills out a detailed report upon arrival, but you can always request to speak with an airport supervisor as well.", "You had us worried there but we're happy to hear everything worked out!", "We're sorry for any discomfort. We appreciate your feedback on how we can improve your experience.", "Sweet! We'll gladly share your thanks and recognize Ramie for going above and beyond, taking great care of you.", "Most of our flights have entertainment or streaming on board. We're sorry it wasn't offered on yours.", "Group 5 is our Preferred boarding group, take a look here for more information, https://t.co/ro6Ga4r4c4.", "That's so fantastic. We love the great amount of generosity in Miami, and throughout the entire country.", "Please follow-up in DM with some additional details.", "If you are unable to fly in your original seat you purchased, You will receive a refund for the difference once your flight is complete."], "84": ["Congrats on getting married! We're looking forward to having lots of excited wedding guests. That's a fantastic deal!", "Absolutely, please DM your 6 letter record locator and we'll let you know.", "We're glad to hear our team is taking greAAt care of you. We'll pass along your kind words.", "We're sorry to disappoint you but we always want to try and provide an option. We'll have you in San Francisco very soon.", "Our sincerest apologies for your delayed baggage. Please DM your bag file and we'll check on an update.", "We've got the Cassandra! We're here to help. We'll take your kudos and forward them to our", "We're happy to help, Naomi. Please, DM your date of travel, location, and name as it appears on your ticket. We'll take a look.", "We can give you that info here. Please follow and DM your record locator.", "We'd love to share the kind words with them, if you send us a DM with your record locator we'll be able to do so.", "Our apologies for the wait and we appreciate your patience. We'll have you up and on your way as quickly as we can.", "We're glad we were able to reunite you with your items, Sarah! You're very welcome.", "We'll send a DM your way with the record locator code you're looking for.", "Carolyn, please meet us in DMs so we can give you some info.", "Please meet us in DMs with your record locator and details.", "We're very sorry about that. We'll have gate side amenities when you arrive to DFW.", "We appreciate you sharing your thoughts on this.", "We'll check what's available. Send us your record locator via DM.", "If you haven't, please file a claim via: https://t.co/JsEGHYNki5 They stay in touch with you of any updates or new info available.", "You sound disappointed, Andrew. Please DM what happened so we can take a look.", "We extended the cap on one-way nonstop fares at $99/$199 (connecting fares may be higher) through Oct. 8.", "Hmm, you may want to try clearing your cache and using a different browser."], "38": ["We have some of the best crew in the business and want you to know that we're glad to have you fly with us today.", "We're sorry that's been your experience. Please let us know if we can help in some way.", "She is a beauty! We won't tell if you don't!", "We're thrilled to welcome you on board today, Pete. Have a fantastic morning!", "We're looking forward to seeing you!", "We'll get you off the plane as fast as we can. Thanks for your patience today.", "We love having Annette as our leader and we're happy you enjoyed her presentation, Sophie!", "She's pretty and we love having her in the family!", "Schedule changes may happen based on operational needs. Please work with our Reservations team directly for new bookings.", "You too, Amanda.", "We're happy to help make your travels as smooth and easy as possible!", "You're welcome!", "Thanks, Leandro! You have a great weekend, too.", "Orlando is a great city! So many wonderful things to do, we look forward to seeing you, Tim.", "It was such a joy to have you up front with us, Carrie. You got a great view from your window too!", "We're happy to be speeding through the air with you and your We love to see our newest flyers on board!", "We love giving that personal touch to our loyal customers like you, Monte! Have a day.", "We're looking forward to seeing you on board real soon, Justin!", "You're very welcome!", "We're sorry things haven't gone as planned tonight. We want to get you on your way as soon as possible.", "Have an amazing flight and time at your conference!", "There are some really great goodies in there to snack on! Enjoy", "Look at all those beautiful birds out the window!", "They may want to reach out to the Red Cross or an official local charity for help.", "Comfy is what we're aiming for and thanks for noticing. Glad to have you on another fantastic flight, Jen.", "We're so glad you have a great time booking with us!"], "77": ["We never want you to feel this way, and appreciate the feedback you provide!", "Our airport team will help get you on your way and take excellent care of you!", "Our offer to take a look stands.", "Our AAdvantage Customer Service team can assist you with that and congratulations, Jennifer! Take a look here: https://t.co/l7FeGMUy12", "It's an important time of year to travel and we're making sure to get all of our customers where they need to be for the holidays.", "We fully plan on operating our flights as normal, Jack. You can sign up to receive notifications here: https://t.co/OtDaH7XmLN", "That's odd, it's possible your reservation doesn't allow for changes. We can take a closer look if you DM your record locator.", "The Flagship lounge is open to First and Business for the long haul overseas flights. Cancun travel won't qualify for access.", "We have the best crews around! We're so glad they took great care of you and your family.", "We have some change options available, Mindy. Take a look here for more info: https://t.co/kNkPUilgez", "We're sorry you're unhappy with the resolution provided by our Customer Relations team. You can reply directly to their email.", "Thanks for providing your bag file number. We'll take a peek and respond to you soon via DM.", "We do! All found items are sent to one central location. Follow this link to create a report: https://t.co/JsEGHYNki5", "We've added a number to each group. The first 4 were originally just called by their elite status. The boarding time has remained the same."], "15": ["Your carry-on bag is oversized by the dimensions you gave us. There will be a charge since you'll have to check it. https://t.co/AqqDo7qAE3.", "You can bring any delicious sandwich in your checked luggage and it'll be ready for you after the flight!", "Please file a claim with our Baggage team and we'll work hard to reunite you with them ASAP!", "Your comfort is what we strive for and our apologies that your seat was messy today.", "We can help you here, Aly. Please DM your record locator and more details on what happened.", "Please work with our reservations team for options, Sophie.", "Our apologies for the delay of your baggage. Please DM your bag file number, and we'll check for an update.", "Did you file a claim with the final carrier? If it was us, please share the claim number via DM so we may take a look.", "Thanks for your patience, Paul. We're glad to see you're now in the air and our captain is going to make up some great time for you.", "The flights were delayed due to the weather. With these type of circumstances we're unable to offer any resolution.", "We're always just a tweet away, Loren!"], "51": ["That’s to hear how smooth our pilot’s landing was. Please DM your record locator and we’ll properly recognize our crew.", "We're glad they're taking excellent care of you and will be sure to pass along your praises to our leadership team!", "Scrappy is the cutest little Pilot pup!", "We know this is an important time of year for travel and we expect to avoid any cancellations.", "Holiday travel is an important time and we're making sure to get our customers where they need to be. We expect to avoid cancellations.", "We're planning to fly as scheduled, Shaun.", "That's correct. The expedite fee wouldn't apply for travel greater than 21 days out.", "Our goal is for every flight to be a success, Isabel. What's going on? How can we help you?", "Your First Class experience is very important to us, we'll be sure to forward along your feedback to our team.", "We can take a look at options for you. Meet us in DM with your record locator.", "Sounds like they're multi-talented!", "We see that you were upgraded for the flight from MUC, but that the connection was requested only. Please DM what happened.", "That's not what we like to hear. We always expect our team to take excellent care of you and we're sorry if that wasn't the case today."], "25": ["We want to make sure communication is crystal clear. Please DM your record locator so we can share your feedback.", "Our apologies for the delay, Heather. You should be in the air shortly.", "That's correct.", "The menu on board states what snacks are gluten free. We also suggest the trail mix or fruit and cheese plate but share the crackers.", "We appreciate your feedback. The Basic Economy rate is great for the customer traveling light.", "If you follow and meet us in DMs with your 6-letter confirmation code, we'll be happy to help.", "We can't offer that, but we'll take great care of you on board.", "Our sincere apologies for the wait. We're going to directly speak with our Refunds team for an update.", "Was your flight canceled, Monica? Please follow and DM your record locator so we can review itinerary.", "The flight is on a maintenance delay this morning. We appreciate your patience with the extra wait."], "19": ["We're sorry you feel that way. We appreciate your feedback.", "That's not acceptable in any way, Alex. We expect our team to be friendly and respectful with our customers. Our apologies for any rudeness.", "We're happy to fly you to Bean Town in style! Have an amazing time.", "We're not trying to make it difficult since want you to be happy. Thanks for letting our team confirm.", "We have no plans on cancelling our flights as of now, Natalia. We assure you though that we'll notify you ASAP if that changes.", "We're not expecting any cancellations during the holiday season, so we're not offering refunds at this time.", "It makes us so happy that you're recognizing many of our members on such an important day. Please check your DM.", "We do our best to always be ready to go for you, but safety is our top priority. We're estimated to leave now at 6:20p.", "We continue to update our entire fleet as quickly as we can.", "We know delays can be frustrating. We're very sorry to keep you waiting this evening.", "Your is strong! We're loving it just as much as we love being your ride through the skies.", "We want our customers to be aware of the great deals offered with the cards, Steve. Thanks for your understanding.", "Your comments concern us. Please meet us in DM with your record locator and more information.", "At the time our fares were capped. If you ever need help with reservations, then please call 800-433-7300.", "Upgrading to Hawaii can be done either with the 500-mile upgrades or an award upgrade, depending on which you want to use.", "It's our favorite place to be too!", "We love having your fur babies fly with us! Be sure to tweet us a pic next time.", "We're following up in DM with more information.", "Safety is our top priority, Emily. We'll get your hubby on the way just as soon as our Maintenance team wraps things up.", "We're so sorry for the delay. Once you've arrived to your destination, please let us know and we'll take a look for you.", "Thanks for this information, Sara. We'll take a look and get back with you here.", "We're always here to help, Jeremy. We can review your flight and check your contact info. Please follow and DM your record locator."], "44": ["Thanks for the shout-out to PVD! We'd love to forward this on to our Please follow and DM your record locator.", "Please follow and share your record locator with us in DMs and we'll be sure to pass this along to our Maintenance team.", "Please DM your record locator, we'll take a closer look.", "We're not seeing any availability today. Please DM your record locator, so we can take a closer look.", "We're working hard to avoid cancellations. You can sign up for notifications here: https://t.co/h88H9iXqqT", "It's an important time of year for holiday travel and we're expecting to avoid cancellations.", "If he's unable to fly and you've purchased a non-refundable ticket, we're not able to waive the change fee or offer a refund.", "Send us your record locator or ticket number via DM along with your contact phone number and email address. We'll look into this for you.", "That's not cool at all and we want to help. Please DM your record locator, Dona.", "Our Lorena is so fantastic, thanks for your kind words for our", "All found items head to one central location. Please follow this link to provide a description of the jacket. https://t.co/JsEGHYNki5", "We appreciate his service. We sent a request for the upgrade, but it wasn't confirmed, therefore your credit card wasn't charged.", "What's going on, Paul. Please follow and DM your record locator and details. We'll take a look to see if we can help.", "We've to know more about this, it's fantastic news! DM your record locator and details, please.", "We hope Freddie has opened up his own AAdvantage number! He looks pretty comfy up there. Fay, can you DM your record locator?", "We're so sorry for the delayed response. Were you able to get on?", "Can't wait to see you on board using your new gift card! We're flying to some really amazing places, too: https://t.co/BhEqSlOhOZ", "Anything for you, Ross!", "Way to go Glad to hear they took care of you.", "Their bags will continue on to CDG with them.", "We're showing AA62 is estimated to depart SNN at 1p.", "Great news, Jeff.", "We love hearing this, and love you being on board even more! Have a wonderful flight.", "Your safety is always top priority and your connection is looking pretty good at about an hour right now. We have later flights if needed.", "We'll be happy to check for another MCE or send a refund on!", "Please meet us in DMs with your record locator, so we can check available options.", "Our sincere apologies for the wait. Our Baggage team will have your baggage to you as quickly as possible."], "24": ["We're excited to have you on board! Thanks for letting us take you on this", "It can only be used towards the price of the ticket. The premium seats purchase is an ancillary charge.", "We do everything possible to avoid cancellations, our team makes sure you're updates as soon as they receive new information.", "We don't know when additional info will be provided.", "We're working to get a crew for every flight and avoid canceling any during the holiday season.", "We always have our best fares on https://t.co/rZn1O8tOMy. Please keep looking for something that works for you.", "Our crew will take fantastic care of you and we appreciate you flying with us.", "Our apologies for the inconvenience, but we're doing everything possible to get you in the air.", "All voucher requests are issued at the airport. Please see an agent for that request.", "Once you've reached your final destination, DM your record locator and we'll review your overall travel experience.", "Please DM your record locator, so we can let our maintenance team know right away!", "What seat were you sitting at?", "You should be fine bringing that bag as long as it fits the size allowance. Here's more info: https://t.co/AqqDo7qAE3.", "We're allowing changes to flights to and from Sonoma County. Please see details here: https://t.co/kNkPUilgez.", "We appreciate your feedback. Thanks for your patience.", "Please DM your record locators and we'll check for more options.", "Aww, how nice. You're the best!", "You-I made EP. Us- We heard, and what happens at AA, stays at AA! Congratulations."], "71": ["Wear comfy clothes, stretch prior to boarding and throughout the flight. Also, make sure you drink plenty of water.", "We'll make sure to let our team know about this. Our friends can also take a look.", "We're not able to adjust the airport list from here. An agent will be able to add you once you arrive.", "We're trying to help and get you on the next earliest available flight. Please allow us to take a look and DM your record locator.", "We just checked and it's there in bright blue with a hyperlink that says Basic Economy. You can't miss it Sean!", "What happened, Beth? We'd be glad to take a look. DM more info.", "Please DM your record locator or ticket number, we'd like to take a closer look.", "We'd like to take a look, please DM your record locator.", "When you go to our website to check-in, you'll be redirected to the Iberia website and you'll use their confirmation code.", "We're sorry to hear you missed your connection, Ian. If you'd like for us to help with rebooking options, please DM your record locator.", "You'd have to speak to an airport agent to see if there's any availability on another airline. They'll do their best to accommodate you.", "We're sorry to hear that. DM your record locator and we can check rebooking options.", "That's wonderful news, Tim. We're glad our was able to resolve and assist you. Have a great rest of your day!", "Please DM your record locator and what you're trying to do. We'll take a look.", "Happy birthday to her! We want to get her on her way as soon as possible, Deanna.", "We've got you on the upgrade list!"], "66": ["Oh my, please DM your record locator and include your email &amp; mailing address. Lastly, provide as many details as possible.", "We expect to avoid cancellations and get you where you need to be.", "We very much appreciate your support and in turn will always strive to provide you with amazing service!", "We loved talking with you and you two look great!", "We'll count you in and we'll have your flight going in time for the holiday season.", "We're actually almost done straightening everything out and we'll be singing Home for Christmas all through the holidays!", "Our maintenance team is working on your flight and our gate team will have more information for you soon.", "We love taking care of our travelers whenever and however we can. Happy Thanksgiving!", "What better gift than AAdvantage miles? Oh the places those miles could take you, have a great day!", "We'd like to help, and encourage you to send us a DM with the cargo shipping details on your furry friend.", "We see the tickets are all set now and we assure you that our and oneworld partners will take excellent care of you!", "We never want to disappoint you, Alex. How can we help you?", "We're glad Tess was able to get you closer to your baby. From all of us, a big to your son.", "We're sorry for the last minute change in plans. Did you want to rebook your connection for tomorrow morning, Lauren?"], "17": ["We're sorry for the situation, but we're happy you're making the best of it, John. Please let us know if we can help.", "It's going to be another great journey and we're very happy to have you on board. Let the begin!", "We know that a wedding dress is precious cargo and our crew will allow it to be placed in the First Class cabin if space is available.", "We understand how tiring these long trips are and we'll have you in the air as soon as we can.", "The cost to buy miles is preset and the chart is available here, Cristen: https://t.co/9zLqAIrtdx", "We can take a look for you. Please DM your record locator.", "We want to keep families flying this holiday season and fully expect to avoid cancellations.", "You bet! Thanks for flying the friendly skies with us today.", "Our pleasure! We look forward to doing it again soon.", "Rest assured, safety is our top priority and you're in fantastic hands. Our team maintains our fleet at a very high standard.", "We're so happy you're in Business Class and thanks for recognizing our", "We'd be happy to see if we can help here, or at least provide more info. Please DM your record locator and details.", "We're sorry for your loss, but happy to hear our helped make the change seamless.", "We're sorry for any rudeness from our team, Rina.", "We're not showing you were reserved for seat 3A, only seat 1A since the upgrade cleared.", "We'd love to share your kudos! Please DM the locator Pamela assisted you with.", "The restrictions are only on our new Basic Economy fares. If more flexibility is needed, we still offer our usual fares.", "Her hair, champagne bottle and even her phone case are beautifully gold. It's only fitting she had an elite status to match!", "What's going on? We're here to help. Let us know if we can turn this around for you.", "We're sure if you let our crew know, our team would be glad to accommodate.", "This is fantastic news and we sincerely appreciate your loyAAlty!", "We'd never want you to miss out on an upgrade, Duane. Thanks for letting our airport team know so they could get it corrected for you.", "Our apologies for the delay, Anita. We really appreciate your patience this evening.", "You can review our carry-on policy here: https://t.co/AqqDo7qAE3. We're excited to be flying you for your first time!", "Our apologies, Katie. Our team is expected to always be professional and we're sorry the gate got switched on you."], "79": ["We're glad you're enjoying some of our great costumes. Their treat is getting to serve our best customers.", "We'll do our best to locate your bags and contact you with an update as quickly as possible!", "That's great to see our airport team in action while we're delayed. We'll do our best to have you in Vegas as early as possible!", "Sorry you're not having a great experience, Eddie.", "We're excited! See you on board soon.", "That's not something we would intentionally do. What's going on?", "Our team can approve temporary expenses until you get your items back. Please contact them and go over all your options.", "What's going on that has you feeling this way?", "Our is so fantastic! Please DM your record locator, we'd like to forward this.", "The good news is, you're arriving and departing gates are right next to on another, so you should have plenty of time to use the restroom!", "To ensure your bags make all your flights, we do ask that you check them back in if you're booked in separate reservations.", "We're here to help in any way we can. Please DM your record locator and let us know what you're needing.", "We provide updates as we receive them, Jason. We're currently planning on a 3:50p departure.", "We're not always able to hold flights. If your parents need assistance, our airport team is there to help.", "Polite conversations are what we want you to have and our apologies for the rudeness you encountered. What's your flight number?", "The departure time is now 8p so please check with the gate agent about a meal voucher. Sorry for the delay.", "Our teams do their best to gauge overhead space and keep you with your bag when possible, our apologies.", "Please let know more details via DM about what happened at the airport today.", "It's our pleasure to have you back on board with us again, headed home sweet home.", "Getting you to your destination on time every time is high on our list. We appreciate your patience with us this time.", "We're showing the bag was loaded in MIA on flight which is now in the air.", "We're here to help, Tiffany. What's going on?", "We always want to provide you with accurate info, Jeremy. If you have any questions about anything we're here 24/7."], "67": ["We're sorry for any rudeness. If you have a Basic Economy ticket, then only a personal item would be allowed on board.", "We understand, Camilo. Be sure to verify that you have all your contents when you arrive.", "When a complimentary upgrade is being used, each elite customer will be upgraded based off their own status.", "We'll update your claim via this link: https://t.co/Lts67cwTlN", "We're doing all we can to get things back up and running normally, we appreciate your patience and apologize for the inconvenience.", "There are taxes to be collected when using miles for a ticket.", "Good things come in small packages. We're always looking to improve. Thanks for your feedback.", "Your safety is our top priority, as soon as our maintenance team gives us the green light, we'll get you going.", "We'd like to look into this for you. Please DM your record locator, and we'll check this out for you.", "We appreciate your loyalty and want to take excellent care of you, Kari.", "American Airlines does not tolerate discrimination of any kind. Follow and DM your record locator and details. We'd like to look into this.", "We're sorry you're having trouble with us. Please work with our reservations team to get this booked.", "Please meet us in DM with your claim number.", "Please give our Baggage team a call at 800-866-4010 for updates that may be available."], "18": ["No problem at all. It’s a huge honor for us to support our troops.", "Sorry for the wait. We're working hard to get everyone taken care of as quickly as possible.", "We don't want you to feel that way. We treat all our customers well and love flying you to AAmazing places!", "Yes, you bought a seat, but if you choose not to select one in advance, we'll assign it upon arrival for free.", "We want your check in process to be as smooth as possible. We're very sorry for the wait, Cristina.", "We do everything we can to make sure small children are seated next to their families.", "Yes, you can check a bag and those fees can be found here: https://t.co/XvGHnVVEv9. A carry-on is allowed under the seat in front of you.", "One way fares are typically more expensive, but our vouchers don't guarantee that it will cover the cost of a ticket.", "We'd be happy to take a look. Do you have a reference number starting with \"1-\"?", "Our ticket counter opens at 4:30a at SJC and as long as you're traveling that day, we can check it for you.", "Providing food or a hotel stay is determined by our airport team, based on the root cause of the extra travel time.", "Our offer still stands to take a closer look into this for you, but we do need your cooperation in providing us the info we requested.", "Your loyalty and feedback are greatly appreciated. We'll forward this to our team.", "If you purchase a non-refundable ticket there are charges for changes.", "Kristen, we're sure the bags will be out any minute. We thank you for your patience.", "We're sorry about that, Tyler. Please take your bags to the Baggage Service Office to file a claim.", "Our team at the airport will be able to assign a seat for you. We're sorry for the inconvenience.", "We're showing you're estimated to depart from SNN at 1p.", "Our airport folks will see if anything closer together is available so please check at the gate.", "Please DM us your record locator and the details. We'll make sure this gets reviewed right away.", "Electronic vouchers are in the works. Our apologies for any inconvenience.", "We're always happy to help when we can, Becky.", "Do you have a paper voucher or an eVoucher?", "We're happy to escort your special one from point to point!"], "23": ["Please send the requested info via DM. We need your contact info (phone and email).", "We had a ball and we're glad our team was in full spirits!", "We're showing an updated departure time of 9:15a, we'll have wheels up just as quickly as we can.", "We appreciate your concern and we'll continue to work with them directly.", "We are working to have the issue resolved prior to holiday travel season.", "You can still book your trip. We have reserve pilots and plan to avoid cancellations this holiday season.", "We're going to take a closer look at this and then once we're done, we'll share more info with you in DMs.", "If you don't end up using that leg then, you can submit for a refund upon arrival into LAX via this link: https://t.co/xM8Vkc7BvM", "We never stop learning, right? Have a great evening.", "You captured a beautiful sunset with our tower in the foreground. We sincerely appreciate your", "It's a delay due to aircraft maintenance. We're going to send more info via DM.", "We're happy to take a look into your flights but we aren't able to offer an upgrade. Please follow and DM your record locator."], "53": ["If we can take a look, then please DM your record locator and details.", "We've got the best in the biz and they're great at handling any curve ball thrown their way. Thanks for the shout-out!", "We'd rather keep you flying with us and assure you that our goal is to always provide a seamless travel experience. Are you flying today?", "If we have room on board, our crew will let you hang it up. Congrats to you, Jostlin!", "That's correct, if you don't take your flight in order, then the whole ticket is invalid. Our apologies for any misinformation given.", "Please follow-up with our team directly via the email they've sent.", "We're sorry for any trouble and thanks for reaching out to us. We're providing more information in DM.", "Please continue working with our airport team directly.", "That's not possible. Sorry, Ajay.", "We always want to remain transparent and we also want to keep out customers info private. Please have our customer contact us directly.", "Our team is always expected to be courteous and respectful. Please share details in DMs.", "We're taking a look now, Kevin. We'll respond to you there in just a bit.", "If you try another browser do you get the same response?", "We're reading it now and we'll respond there.", "Welcome aboard again today, Lonnell. It never hurts to freshen up on the emergency exit locations!", "The full amount would be required for those flights that aren't complimentary upgraded. https://t.co/2JRtNKeaB2", "We sure don't want to lose you and would love continue flying you to destinations."], "12": ["We're sorry that this has been your experience, is there some way we can help?", "Please let us know if we can help in some way.", "The club is open from 8a-10p, our team will operate the office after arrivals.", "We see your DM and will reply to your comment there.", "We'll be departing real soon. Thanks for hanging in there.", "Delays are never ideal and we do all we can to avoid cancellations, our apologies. We'll have you on your way as quickly as we can.", "Our team does their best to get you reunited with your things as quickly as they can.", "We're sorry for the wait. We'll get your bag back to you as soon as possible.", "We'll do all possible to make up most of the lost time while we're in the air. Thanks for your patience, Myles", "We offer Main Cabin fares as well, which include a carry-on. See details about your ticket here: https://t.co/MKvFFVWJdz.", "We've capped our fares for nonstop flights at $99 for Puerto Rico through the 8th of Oct. Book travel here: https://t.co/iJWiiSmxCO"], "16": ["Please DM your record locator. We'll take a closer look for you.", "Our apologies for the damage to your bag. Please speak with our Baggage office at the airport to file a claim.", "You'll need to continue working with our friends at Citibank. They can be reached by phone at 1-888-766-2484.", "We're still flying and no cancellations are expected.", "Way to rock it It's a pleasure to make your travel the best from start to finish.", "We want to keep families flying this holiday season and fully expect to avoid cancellations.", "We want your travel to be enjoyable, Christina. Please speak with our flight crew to reset your screen.", "It's our goal to get everyone where they need to be for the holidays. If we make any changes we'll be sure to let you know.", "We look forward to welcoming you into the", "We'd be happy to take a closer look into this for you. Please follow and DM your ticket number along with any additional details.", "We love our traveling families and we're so happy they enjoyed the flight. We can't wait to see you guys on board again soon!", "You can request a refund via this link: https://t.co/xM8Vkc7BvM under bereavement.", "We're so glad our was able to help during this exciting time. We'll be sure to pass along the compliment!", "We're sorry you didnt' have a good experience with us. We hope you'll give us another chance to impress you."], "2": ["We'd like to forward this along, Mindy. Please DM your record locator.", "Our is amazing. We're so glad they took excellent care of you this weekend.", "We expect great service and big smiles for you as you board! We'll have everyone on and in the air shortly.", "You may not be able to bring a bag past security that wouldn't qualify as a carry-on bag on a Main Cabin ticket. Our apologies.", "We'd like to take a closer look into this. Please DM your record locator.", "We're sorry for the wait, Hazel. We'll have you wheel's up and on your way as soon as we get clearance.", "Are your flights all in the same reservation? We can double check for you, if you meet us in DM with your record locator.", "We expect our team to be professional and courteous at all times and we're truly sorry that you've had this experience today.", "Sorry for the wait. We want to get you off of the airplane as soon as possible.", "We're always happy to help when we can, Brian!", "Thank you for providing us with more information in DM. We're taking a closer look.", "If you meet us in Direct Message, DM, there's no character limit and we can request your reservation details.", "Are you trying to contact Reservations? They are available for your call at 800-433-7300.", "What change are you trying to make? We may be able to help. Please DM your record locator, and the changes you're needing.", "Glad they were able to wait just a bit for you! Please DM your record locator and we'll be sure to pass on your thanks.", "We're happy to help! Please DM your 6 letter record locator with a follow for rebooking options."], "47": ["We're very sorry. We've forwarded it to our team that handles Wi-Fi.", "It's a pretty sweet ride if we say so ourselves!", "We're sorry for any wrong info given. We've already confirmed you on that flight. Please see an agent for your boarding pass.", "Please see here for more info regarding filing a claim: https://t.co/c2WPmpJSpV", "Baggage charges are paid on the day of travel only, but here's a great link with more info: https://t.co/XvGHnVVEv9", "We're sorry for the extra wait time. We'll have you in the air as soon as we can and appreciate your patience.", "We're excited to be your ride through the skies today and look forward to many more", "Sure, let us take a look. Please DM your record locator.", "We've sent you a DM, Michael.", "Happy to have you on board Chris!", "We're diligently working on this issue and will provide more info if your flight is affected just as quickly as we can.", "What a wonderful picture, not to mention such a cutie! We love that this he's reading up on the safety card!", "You can always contact Reservations at 800-433-7300 for info on prices.", "We're sorry for the extra travel time. Please DM your record locator so we can take a look.", "We'd be happy to take a peek at your reservation, Scott. Please move into DMs with your record locator.", "We love our military men and women and we're truly sorry we weren't able to confirm the upgrade this time.", "We're excited to have you ride up front with us, Ben. Surprise upgrades are always fun!", "Hannah, please give us a call at 800-433-7300 and we'll be happy to take a look.", "Little birds heading to big places, Augusto. Enjoy your flight!", "Are you chatting with Web Technical Support? If you need to escalate it, ask to speak to the manager on duty to check options.", "Tickets are nontransferable, so we're unable to change the name. Continue working with your booking source for options.", "It's great when we arrive early but sometimes the gate isn't ready for us, but we're sorry again for the extra time on board.", "Glad we could help! We're always here for you, 24/7."], "26": ["Please DM your record locator. We'd like to share this feedback with the Flight Service leadership team.", "Our apologies for the delay. We know that waiting is no fun and we appreciate your patience.", "We're sorry for the late start this morning. We're showing everyone has boarded, and we'll have wheels up soon.", "Our pleasure! We love making your experience the best it can be from start to finish.", "Sorry you're not comfy on board. We'll have you cooled off shortly.", "We’re working hard to ensure we get our customers to where they need to go over the holidays.", "We're working on getting a crew for every flight we have and expect no cancellations. We look forward to seeing you soon!", "Your first and last name are most important. Please contact our team for any other concerns about your upcoming travel at 800-433-7300.", "We know the airport can be busy and stressful, but that's no excuse. We're sorry our team was unable to help more.", "We have your DM and will be with you there shortly.", "That moment you hear those words, how exciting!", "Evan, we're following you and would need to take a peek at your fare rules and restrictions. Please DM your record locator with details.", "It may take a bit to taxi before departure and we're glad to see you're now airborne, Chris.", "Thanks for the shout-out, Dan! We always want our customers to fly with their bags if they're on the flight.", "Our airport team makes the final determination when inspecting the bag if it meets the size requirement. We're not able to offer a refund.", "Please reach out to them directly, you can see the contact info here: https://t.co/O6Fdx4Pk6T", "An on-time departure is always the goal and we're sorry for the wait, we'll have you on your way as quickly as we can.", "Our flying moms are very special passengers and glad to hear things worked out for her.", "We'll get you in the air and on your way just as fast as we can, John. Thank you for being patient.", "It's not our standards nor expectations and that's a record that we're looking to change. We should be soon though.", "If window or aisle seats aren't available, you're welcome to check with our airport team for a possible change.", "Way to go Tonya! DM your record locator so we can pass this on to our", "We'll get you boarded and headed out soon. Thanks for your patience this morning."], "87": ["We understand that's important to update info quickly and we appreciate your feedback on this.", "Everything is up and running. What error message are you getting?", "Please DM your record locator and what happened. We'll take a look at it for you.", "You're very nice, Ho Min. We'll take great care of your bag.", "We see your DM and will reply to you there.", "If a flight of yours is cancelled and you don't rebook with us, we'll refund the unflown segments.", "The safety of all of our customers is of the utmost importance, Kathleen.", "This restriction only applies for Basic Economy fares which were designed with light travelers in mind. https://t.co/MKvFFVWJdz", "Getting the updates as soon as possible is important! Check out this link for the best way to get them: https://t.co/h88H9iXqqT", "We don't want to be the reason your Thanksgiving is ruined. Have you been rebooked? Please DM us your locator and we'll see if we can help.", "We know it's upsetting to check a bag you wanted to carry on, and appreciate your cooperation with the team.", "Basic Economy is only one of the many different types of fares we sale. You're not required to purchase it.", "We count on all our team to be courteous and kind and apologize for any rudeness you received.", "Wow, what a great story, Caitlin. It makes you realize there's still good in this world.", "He's in with us! Sorry for the wait tonight. We'll have you both on your way as soon as possible.", "We're very sorry for the wait. We want to get you on your way as soon as possible.", "Please share your record locator with us via DM so we may take a closer look with you.", "Woohoo! *high five* We're glad everything worked out for you and your bag was along for the ride.", "We'd like to help if we can, Stephanie. DM your record locator and let us know more details.", "Please DM us and share the error message you're getting. Also, include details on how you're trying to book and we'll take a look."], "5": ["Gate information is shared on the website. Just input your flight number here: https://t.co/hSJ3SkyGEd.", "We're so glad you've been reunited with your bag, Stephanie. Our can sure work some mAAgic.", "We just want to make sure everyone is aware of the great benefits of the card. Thanks for your feedback.", "We'd be happy to take a closer look into this for you. Please DM your record locator.", "We're working diligently to take care of our customers and we look forward to having you on board!", "We can take a closer look, please follow and DM additional details.", "There is a $75 expedite fee when booking an award ticket less than 21 days in advance.", "If you share your record locator and details via DM, then we'd be happy to take a closer look.", "We don't offer refunds if you used the seat you reserved. If the gate team assigns the seat, it would be free if still available.", "Johnnie, we're happy to have you and your loyalty means a lot to us. Please let us know if we can help with anything specifically.", "Sorry for your disappointment. We'd love another chance to provide you with a better experience the next time.", "We’re happy to listen here via DM if you’d like too. Please give a quick follow and DM details", "Your feedback is important to us and this info has been forwarded to Flight Service.", "If you're no longer flying with us, you can request a refund here: https://t.co/xM8Vkc7BvM. Feel free to DM us more info."], "28": ["It is indeed and we're so proud! By the way, our team in ORD loves you too, Matt.", "We're more than happy to do that, Myra. Please DM your record locator and we'll share your awesome kudos.", "You bet! A great experience is what we aim for every time.", "We sure will!", "Once you arrive at your destination, please follow and meet us in DMs, we'd like to send you a little something for your troubles.", "Sorry for any confusion. We can double check your baggage allowance if you'd like. Just DM your record locator.", "Yippee, we love providing a smooth and seamless travel experience!", "We're sorry for any trouble you've had with our app. Please be sure you're on the most updated version and DM additional details.", "We love keeping you connected up high in the skies!", "We'll gladly take a look and clear things up, if you can please DM your record locators.", "There can be many reasons for this, our team may just need to do a document check. Our apologies for this.", "OJ is the way to go! Thanks for joining us on board.", "We're happy to take a peek, Karen. Please meet us in DM with your flight number, date of travel, and the name on the ticket.", "We'd like to help if we can. Meet us in DMs with your record locator and more details about what's going on.", "Although we don't have those kind of powers, check out our great schedules and fares here: https://t.co/iJWiiS4WLg", "Thanks for letting us know and have a wonderful trip!"], "55": ["She's a beauty! That's a major throwback.", "We'll respond shortly via DM.", "We don't want you to feel this way, how can we help?", "We're so sorry this was your experience. Please let us know if we can help in some way, Tom.", "What an AAwesome pic, we're so happy they took excellent care of you guys. Come back and see us again soon!", "Whoa, we're so sorry for any rudeness you encountered from our team. Please let us know how we can help turn things around.", "We expect our team to be professional and courteous at all times and we're very sorry for any rudeness. How can we help?", "We're operating as scheduled and we expect to avoid cancellations.", "Please let us know if we can help.", "We know you're ready to be off the gate, and truly appreciate your patience today.", "We offer a Same Day Confirmed option for $75. That's the best way to get on a different flight than scheduled.", "We're working on modernizing our entire fleet, Samantha. Thanks for hanging in there.", "What's going? How can we help?", "We hope in the future we can make it up to you and your family. We're always striving to provide our customers with service.", "That sure isn't how we want you to feel about us. What's going on, Aly?", "We can take a look with you via DM or you can give our Reservations team a call at 800-433-7300.", "We want all your travels with us to be fabulous. Please DM your record locator and share what's going on.", "What's going on? We're glad to check on it for you.", "We strive for a great rewards program, and are sad to hear you're not liking what we offer.", "Our Same Day Flight Change is an optional way to change flights at a lower cost. Send a DM our way and we'll see if it's available."], "61": ["On domestic flights blankets are only offered in First Class. We love traveling families and are sorry for any rudeness.", "Let us know what you think! We're excited to have you on board.", "If they're going to let you off the plane, we can move you to flight 19 departing at 9:05a instead. Please let us know if that will work.", "There will be more info provided soon. We're very sorry for the delay today.", "We don't plan on making any cancellations at this time. You can sign up for notifications here: https://t.co/h88H9iXqqT", "We're very sorry for your son's inconveniences and we'd like to hear more. We'll need for him to contact us directly in DM with details.", "We have no intentions of cancelling our flights at this time and are diligently working on making sure everyone gets home for the holidays.", "We definitely want to keep families flying this holiday season and fully expect to avoid any cancellations.", "We're not aware of any issues, Melissa. We'd like to share this with our App Team. Please follow and DM your record locator.", "Bags that fit within the carry on size limits may be asked to be checked at the gate, anything larger will need to be checked before.", "We want all of our customers to feel welcome each and every time they fly with us.", "We're sorry for the delay but appreciate you hanging in there with us. We'll have you in as soon as we have clearance.", "This concerns us deeply. Did he speak with a baggage agent at the airport to open a claim?", "This is music to our ears but we're sorry for the inconvenience. We can't wait to have you back on board soon.", "We'll have you rolling into a gate in just a few. Our apologies for the extra travel time.", "We're sorry you had to check your bag this evening, please provide your flight number so we can forward along your feedback.", "Looks like it's worn down over the years. Sorry for any frustration this caused you, Mark.", "We haven't forgotten about you and still see that our team may still be investigating this. We'll ensure to follow up with them.", "That's not what we like to hear. We'll pass this info along to our team to get it resolved. Thanks for letting us know, Guilherme."], "78": ["We don't tolerate discrimination of any kind. Please DM your record locator and contact details (phone and email).", "You shouldn't need to. Let our airport team know if you need assistance on the day of departure.", "We know this can be frustrating, Paul. Please meet us in DMs with your record locator, or ticket number.", "We can take a closer look at your reservation. Please DM your record locator.", "Our friends are always available if you need assistance. Please reach out to them if you're having issues.", "We're working to correct the issue and expect to avoid any cancellations this holiday season.", "Correct. Please make sure you take a look at the link provided. We want you to know of all restrictions under Basic Economy.", "We're sorry there ended up being space available but we'll get your bag back as soon as you reach your destination.", "We're all hands on deck and are eager to help you with your travel plans. If we can assist from here, please DM the details.", "We feel your frustration and we're sorry for the delay. Our team is working hard to get you wheels up and on your way ASAP!", "Premium seats are simply an option that we offer. You're not required to purchase them.", "We'll never make you pay for as seat. Please DM us your record locator and we'll take a look.", "They're different department, Kathy. They work with account questions or discrepancies that you may have noticed.", "You're welcome, we appreciate your loyalty and will respond back just as quickly as we can!", "We always want to keep you with your bags but stowage space may become full. No worries though, our team will have it returned upon arrival.", "We know waiting is frustrating. Our apologies for the extra travel time.", "Hi there! The checked bag charge is nonrefundable.", "Rob, did you alert a crewmember or manager at the airport?", "Our apologies for the troubles on board, Ryan. We'll get this over to our team so we can get it fixed as quickly as possible.", "We're sorry for the inconvenience. This is the number to our reservations team who can assist you.", "We've double checked and you have seat 1A at this time.", "Our sincere apologies for the seat swap, Michael. We always try to keep you in the same seat whenever possible.", "We're more than happy to help! If you'd like to DM your question, we'll be happy to check into it.", "With a Basic Economy ticket your bag has to fit within the size allowed. If it's larger you'll have to pay additional.", "We were actually going to say it looks like that BA plane's going to gobble us up. When we see a chance to play and have fun, we go for it!", "We have a team that's researched all aspects and this is the most efficient including all factors. Thanks for the feedback.", "We're taking a look now, Tiffany. We'll respond to your DM shortly.", "We do all possible to avoid delays and we're so sorry your travel has been affected. We'll have you soon.", "We've resent the email with the itinerary for you. You should receive that within a couple of hours.", "We're happy to help our any way we can!", "We can see how that's frustrating, and assure you, we don't have a say in who gets the PreCheck status."], "14": ["We do many checks pre and post departure. Please share your flight number if we can provide an update.", "Restrictions are shared on the right side of the purchase screen before purchase. Please contact Orbitz for more information.", "This isn't how we planned to start your birthday celebration. We're working hard to get you going soon. Thanks for your patience.", "Your time is important and we're sorry for the wait. We'll have you off and on your way as quickly as possible.", "Bags can't be checked past the cut off time. Our team needs enough time to transfer your bags to the flight.", "We're sorry your travels with us today aren't going as planned. We're finishing up now and should be airborne soon!", "We see our Reservations team assisted with rebooking, Henry. We're so sorry for the extra travel time.", "Our system is unable to check your bag in once the cutoff time is met. We'll get you to your destination as soon as possible.", "We never want you to have to do that but we're here to help. What's going on?", "She's a bird!", "Hmm, send us a quick DM with your 6 letter record locator with the proper spelling. We'll take closer look with you.", "We know you're ready to be off the plane, which we can do as soon as the path to the gate is clear.", "We're glad to hear you've been reunited with your bags. Our apologies again it took longer than usual. Have a great Friday!", "You may have found your lucky numbers, Ashvin. It's time to play the lotto!", "Tiffany, we care about our passengers. Please DM your record locator and details.", "What's going on Bob? DM us your record locator and more info.", "We're happy to help, David!", "Some systems don’t show irregularities until ground power is connected or engines are started. We’re sorry for the delay.", "Our team is working quickly to get you into a gate. We're so sorry for the inconvenience.", "Your safety is our top priority, Kayla. You're in with us!", "What's your flight number? We're happy to take a look for you.", "You can do that here. Please meet us in DM with your record locator.", "We're so sorry for the delay, Gregory. Looks like we'll have you soon.", "We can take a look for you. Please meet us in DM with the record locator.", "We're very sorry for the confusion. Let us know if we can assist here.", "That's not how we want you to describe your experience, what's going on? Please share your record locator via DM."], "49": ["We've got the best in the business and our loves taking care of everyone! Thanks for letting us know how great she is.", "We'd like to take a look at this John. Meet us in DM with your KTN, date of birth and name as it appears with TSA.", "Did you mean Tucson? If so, we offer direct flights to PHX and then you can take a quick hop over TUS in no time!", "We see your tweets and we'll review and respond back in DMs.", "We always want you to be comfy and we're glad you're enjoying the extra leg room. Have an AAwesome flight!", "Our maintenance team is doing all possible to get you in the air. We appreciate your patience.", "We always want you to enjoy your time in our Admirals Clubs. Thanks for your feedback on this.", "Stephen. Enjoy it!", "We're sensing some frustration. How can we help you today?", "We're here for you if you have a question or concern. Please don't hesitate to reach out to us!", "We try to find the best options for our customers. We're sorry there wasn't First Class available on this flight.", "news, we're glad you are able to relax. Have a great flight.", "The struggle is real We hope your Thanksgiving was AAmazing!", "Our planes are regularly washed and we always want you to have a good from your window seat. We're sorry if they're dirty today.", "Every person earns their own status. Even the kids", "Now that's an interesting way to pass some time during a flight.", "Oh no! We sure don't want that to be our record with you. We see our airport team has you backed on the next flight. Sending you a DM.", "It's due to a previous flight, please stay updated with the status via: https://t.co/hSJ3SkyGEd", "Absolutely, we can do it!", "Your bags are in with us Poornima!", "Please let a crew member know, Bridget. They can get you something to take care it or a possible change of seats.", "What an awesome"], "65": ["Sorry for the inconvenience, Samiey. What's your flight number? We'd like to pass along your feedback.", "We're sorry for the wait, Victor. Your safety is our priority. We'll have you wheel's up and celebrating as soon as possible.", "We know this isn't the day you had planned, but we're so happy our team is taking excellent care of you!", "We've received your DM and we'll respond shortly.", "We'll take care of our pilots and ensure we get everyone where they need to be over the holidays.", "We do offer Main Cabin Extra seats which come with additional legroom, take a look: https://t.co/N9kHMrvr7b", "Did we just become", "Please have him work directly with our airport team, Carolyn.", "Our team is checking things out and planning on a 4:50p departure. We very much appreciate your patience.", "The weather hasn't been playing nice, and this caused an Air Traffic back up. We're working hard to have you wheels up ASAP.", "Meet us in DM with your record locator so we can take a peek.", "We don't have any updates on his claim at this time. Our apologies for any frustration this caused.", "What's your flight number? We'll check on an update.", "We gauge overhead space to the best we can, please DM your record locator so we may share this with our team."], "68": ["We're sorry for the frustration this caused. We're glad to hear you've been rebooked.", "Our Maintenance team will do their best to have you on your way as quickly as possible.", "We're very sorry for the delayed departure.", "We have a great team diligently working to address this and expect to avoid cancellations.", "We have no plans on cancelling any flights at this time, Ken. If that changes, we'll notify those customers affected as quickly as we can!", "We've We'd love to forward your shout out to them and the rest of our Please DM your record locator.", "We're working hard to include power on most our planes and either inflight entertainment, or streaming capability, David.", "We appreciate the shout out, John. We're glad to be able to help her out.", "We'll take a look at the connection. Meet us in DMs with your record locator.", "We know you're eager to be on your way to a wonderful anniversary, Gary. We're so sorry for the delay.", "Our apologies, we do see it was originally maintenance, and then the incoming replacement was delayed by Air Traffic Control.", "We know waiting is frustrating, Jonah. Thanks for being patient with us tonight.", "We appreciate your patience and are glad to see you're on your way. Our Captain is making up some great time for you.", "We're unable to upgrade here. Please have her work with our team at the airport for available options.", "We know you want to get to your destination right on time, Becca. We're so sorry for the delays."], "7": ["We want you to stay entertained while on board. Take a look here for info on streaming to your device: https://t.co/n3xnGPgfe2", "We appreciate your feedback and your loyalty!", "We serve Biscoff cookies and drinks for free, Jasen and then for a cost, you can purchase a wide variety of snacks: https://t.co/j9ZwUnZ7sY", "Our team is AAmazing and we're so happy to have Annette as our leader. We're glad you enjoyed her presentation!", "We'll have everything up and running in December. Take a look her for more info: https://t.co/2l3PoK3sPo", "It sounds like you booked this thru your travel agency and corrections like these have to be made by them. Are they open before your flight?", "We appreciate you saying that, but more importantly we appreciate you flying with us. Have a fantastic day and weekend!", "We sincerely value your loyalty and feedback is how we continue to improve. We'll be sure to turn things around during your next trip.", "We see your DM and will respond to you there.", "We sure don't like hearing that we've disappointed you. We want all your flights with us to be greAAt ones!", "Please send us a DM when you arrive, we'll review your request.", "We've contacted her and asked her to DM us details. Thanks for the heads-up on this!", "Yay! Welcome to the", "We hope your sweet tooth is ready for all the sweet treats.", "Absolutely, we'll be standing by and waiting for you there.", "What happened during your flight? Please DM details so we can forward it on to Flight Service.", "We love our military families and we're always happy to help when we can, Tracey!", "We're so sorry your bag didn't arrive with you. Our Baggage team will get it out to you just as fast as they can.", "No other action is needed, Monica. We use customer feedback to help us become better and if necessary make overall changes to our policies.", "Our baggage team will be in touch about your claim as quickly as possible!"], "75": ["You're good to go as long as you have your British passport and return/onward ticket.", "We'd be happy to take a look with you and see what your options are. Please send a quick DM with your record locator.", "Good Morning, Christian. Have a fabulous flight!", "We're sorry to hear this, Mike. Please DM us your record locator and we'll take a look.", "Please let our flight crew know then, Hazel.", "Our crew's going to have you pulled into the gate as soon as possible. We're waiting for the thumbs up and we appreciate your patience.", "That sounds like the perfect treat when you're on the go. Sara. Thanks for your AAwesome praises on the new club!", "We're sorry for the wait. Please DM your record locator and we'll take a look at that upgrade for you.", "What's your record locator and we'll take a look. Please be sure to keep your info private and send via DMs.", "We're sorry for the frustration this caused. Please check your spam/junk folders. Let us know if you find it there.", "Once you've filed a report with BA, you can check online using the following link for updates: https://t.co/oyQoVPSWZW", "We offer many fare option, including Main Cabin fares that including a carry-on. Check details here: https://t.co/MKvFFVWJdz.", "We feel your frustration and we're sorry we've upset you, Group 5 now was previously known as Group 1.", "Luggage charges are collected at the airport only and our team will calculate what they'll be when you check the bags in. See you soon!", "Please have her reach out to us here if she needs assistance. We're always here to help, 24/7.", "What's going on, Katie? We love sharing the skies with you and want to help if we can.", "This isn't the way we want you to feel. Is there anything we can help with today?"], "6": ["We know this can be upsetting. See our airport team when you arrive for your options.", "We currently have an estimated departure time of 7a out of LAX. It shouldn't be too long for us to get in the air. Thanks for your patience.", "We know delays aren't fun and we do our best to avoid them if we can. What's your flight number? We'll get an update.", "Anytime departure time is past the scheduled take off is considered a delay.", "Our team will be there to help! Thanks for your patience.", "How long were you without your bag? Please DM us your record locator and we'll take a look.", "As long as your little one appears under 2, you don't need to bring any proof of age.", "We'll get you and your bag transferred over as quickly as possible. We appreciate you flying with us.", "We appreciate your feedback and apologize that we couldn't accommodate your request.", "We're here to help with document questions, if needed. Please DM your record locator and nationality.", "Sorry for the delay tonight, Michal. We always want to get you to your destination on time.", "Now we have this song in our head! Love having you commuting with us instead of the Sam Rayburn.", "We appreciate your patience and we're sorry for the wait, we'll get you going as quickly as we can.", "Please give our baggage team a call at 800-535-5225 so we can get started on tracking it for you.", "Well then, let's make it happen!", "We want your booking process to go smooth from start to finish. Have you tried using a different browser?", "We never want to leave anyone behind. Please DM your record locator, so we can take a look.", "Once she arrives if both bags have not arrived, she'll need to file a claim with our Baggage team at the airport.", "We want to board our customers the fastest way we can to ensure an on time departure: https://t.co/ro6Ga4r4c4", "You're unable to travel with an electric skateboard. You can find more info here: https://t.co/AhnDRfxtKk"], "63": ["That's an amazing, we're glad you could catch the gorgeous Texas sunset from the club!", "We hear your frustration and will have you on your way soon. Our sincere apologies for any inconvenience caused.", "We want to always provide you with great service. Our apologies if you received any less.", "It sounds like our seats are going fast, Kristel. All our fares are based on advanced purchase and seat availability.", "Usually, First Class or full fare tickets allow you to make voluntary changes and it's even refundable without any penalties.", "They're on their way and will be there as quickly as possible. Thanks a lot for your patience.", "We're not currently providing capped fares. We're sorry for any disappointment this causes you.", "Please have Chad send a direct message our way, and we'll see how we can help.", "We'd sure miss you soaring through the clouds with us, Caleb."], "36": ["We're so sorry to hear about your mother and we're wishing her the best of wishes. Please follow and DM additional details.", "Our apologies things aren't going as seamless as we planned. We'll have you where you need to be as quickly as we can.", "You have lots of room to stretch out. Enjoy!", "Cheers, it's a joy having you in the", "Someone call the we can't get enough of your adorable companion!", "We're expecting to avoid cancellations this holiday season, you can check the status of your flight here: https://t.co/hSJ3SkyGEd", "You can stay updated with the status of your flight here: https://t.co/hSJ3SkyGEd", "We'll have everyone on board and wheels up as quickly as we can.", "We're planned for an on-time departure and look forward to seeing you on board with us this holiday season.", "We're showing your flight into DCA, AA2343, is scheduled to depart by 9:20p. Please continue working with our airport team for updates.", "We strive to keep your info safe. We're sorry that piece of paper wasn't properly disposed of.", "Oh no, please make sure he fills out a lost and found form online, this will allow us to get it back to him quickly! https://t.co/JsEGHYNki5.", "We're showing a departure time of 8:10p departing from L6.", "That doesn't sound quite right, please meet us in DM and share the record locator with more details.", "Based on operational needs an equipment change may happen, our apologies for any inconvenience it's made to your travel plans."], "41": ["We're showing AA723 is on time as of now Marisa. We'll have you on your way soon!", "We know our will take excellent care of you. We're looking forward to having you on board.", "Restricted tickets have a charge for any changes. We're sorry you didn't find an option that worked for you.", "We're sorry this is how you're feeling, Jake. Please let us know if we can help in some way.", "Your 13 digit ticket number will be on your credit card statement from when you purchased it.", "We know it's frustrating and want to get you reunited as soon as possible. We're sorry for the inconvenience.", "We encourage customers to arrive to the airport early, saving time to clear the security checkpoint.", "We'd be happy to take a look into your reservation, Paul. Please DM your six letter record locator.", "We're looking forward to giving you a superb experience.", "They may not have not had enough time to make the bag changes. You can check the status of your bag here: https://t.co/vpkBeWiqTq", "We want to reunite you quickly with your bags. Please work directly with our Baggage team.", "We're so sorry that your flight was canceled. If you need any further help let us know.", "We can assure you these matters are taken very seriously. We appreciate you letting us know what happened.", "We're glad you've made it to your destination. When you get a chance, please meet us in DM with your record locator.", "It's a 6 letter code, Shawn. Do you have your ticket number? If now, how about flight number, date of departure and full name?", "We'd be happy to take a look with you, please DM your record locator."], "82": ["We're very happy to hear how our FA on board was. We've your info and we'll be sure to pass your kudos along.", "That's sure an awesome sight to see, Ben. We can't think of a better way to start off the day!", "We see your DM and will reply to there.", "Your record locator is your 6-letter confirmation code. You would first follow us and then send us a direct message with that info.", "We'll be in contact soon.", "Thanks, Tonya, we love the holiday season and are glad the decor adds some joy to your day. Have a fantastic flight!", "We'd love to be able to fly to more place, Brandon. We hope it's available to us in the future.", "What a beautiful day in the Ricardo. Thanks for capturing today's events!", "Please follow and meet us in DM with details on your ticket and we'll take a closer look.", "It's a direct message. We'll DM you and you can respond there.", "You'd need to reach out to our AAdvantage Customer Service team. Here's a link with their info: https://t.co/l7FeGMUy12", "That's a reason to put the petal to the metal and you're right, what a beautiful day to fly. It's our pleasure to have you on board!", "Safety for our customers is of the utmost importance. We appreciate your understanding with the need for extra travel time today.", "Once the travel is complete, you're welcome to make a refund request here: https://t.co/xM8Vkc7BvM", "If we can be of any assistance, please DM your record locator.", "Thanks for joining us today!", "We don't doubt that one bit. You get to sit back and enjoy your day off.", "The seats can be assigned off our website. If you're not able to find it, please DM your record locator and we'll take a look.", "Wow, that's so pretty!", "We don't like the sound of this and we'd like an opportunity to look into this further. Please DM your locator and more details.", "This isn't the experience we wanted for you. DM your record locator so we can share your feedback.", "We're working on our carbon footprint. Check out the following with some great information. https://t.co/pLPtpavkpL", "We see your DM now. We'll respond in just a moment."], "22": ["We've moved you to the 9:05a flight, but we're unable to offer an upgrade. Please DM us when you land and we'll look at other options.", "We love taking great care of you, Kyle! Hope to see you again soon.", "We have every intention of operating flights as scheduled and expect to fully avoid cancellations.", "We'd love for you to fly with us. Keep checking for any great deals. We hope you find something that works for you.", "We're taking a look at it now. We'll respond there soon.", "We completely understand, Erik, but we're happy the rest of the trip was good!", "Our apologies, Drew. We know your time is valuable and we'll have you in the air very soon.", "Nothing like a cup of coffee to start a busy morning. Enjoy!", "Good morning. We count on every team member to be courteous and kind with our customers always.", "We love it and we're so happy you included us in your travel plans. Come back and see us again soon!", "We're glad to hear you had a great time, Elizabeth. It's what we strive for!", "Rae, we're so glad you enjoyed your First Class pods! We thank you for sharing your feedback with us about flight schedules", "Your bag is being forwarded to Madrid now! Your patience is appreciated.", "We took a look and a refund was sent on July 27th for $200.90 to Visa ending in 4022. Did you not get the refund?", "The connecting flight canceled while you were inflight and we rebooked you on the first available.", "Our Baggage team is working on this for you. If you have questions, then please ring their team at 800-535-5225.", "A heads up from the crew about some bumps along the way is always a nice thing to hear!", "We'd love to have you on board with us! Check out https://t.co/rZn1O8tOMy for some great deals.", "We want to reunite you with your bags quickly, Andrew. Have you filed a claim with our Baggage team?"], "1": ["Our apologies for the late start, we have an updated departure time of 7:35a. Thanks for your patience.", "Lorna is Sara. She really goes We'll be sure to forward your praises to her and the rest of the", "Here's to many for fond memories, Brian!", "We're working on this issue and expect to avoid cancellations.", "It's common for all airlines to have schedule changes, Damien. If we can help with rebooking options, please let us know.", "We're addressing the issue now, Peter and fully expect to avoid cancellations.", "We want everyone to get the help they need. If help is needed, ask our gate agents so they can arrange to have someone assist or check it.", "Our team will notify you as quickly as we can of any changes to your flight.", "Oh no, Brooke. You caught us. Now you know we're human,", "We're truly sorry for any damage done to your equipment. If you'd like for us to have a specialist contact you, DM the info requested.", "If you give our AAdvantage Customer Service team a call, they'll look into this with you to clear things up: https://t.co/l7FeGMUy12", "We've got a warm spot in our hearts for of all kinds.", "We love flying with you too and our attendants will address anything you need. Glad to have you on board with us!", "Beautiful! Thanks for sharing, Shane. We love the changing colors too.", "We've been reserving extra cargo space for charitable organizations. Please contact a local charity for assistance with this.", "We'd like an opportunity to assist. Meet us in DM.", "Thanks for joining us the morning, Jeff! Sit back, relax and enjoy the ride.", "We'd like to look into this with you, please meet us in DM and share some additional details.", "We're here to help get you to see your mom. Please follow and DM details about this experience this morning.", "You bet we'll pass it right along to the hard working ladies.", "Please DM your record locator with a follow for a look!", "We love helping our customers and we're happy that our rep gave you great advice. See you on board for your trip, Michael!", "Our truly is an incredible and generous group of people, and we really appreciate your kind words.", "Sounds like you may have purchased a Basic Economy fare, Alyssa. Please see https://t.co/MKvFFVWJdz for more details.", "Such a pretty bird! He definitely earned that spot on the aircraft."], "31": ["Good morning! We can't wait to have you on board. Have a greAAt flight.", "We love our comfort food! Looks so", "We want to minimize the impact of delays to our customers. This is a quicker way to get rebooked.", "We'd like to take a look into that, Giliane. Please DM your record locator.", "Our team is working hard to avoid cancellations and you'll be notified if otherwise.", "One of the restrictions when you buy a Basic Economy fare, which must be agreed upon before purchase is no access to our bins.", "We invite you to share your record locator with details via DM.", "We appreciate and value your business, Brady. Please don't hesitate to ask our crew or gate agent for alternate seating arrangements.", "Do you need help with a reservation?", "We're glad you liked it! Thanks for your kind words and have a fantastic day.", "We're so happy that you're enjoying our beautifully renovated lounge! Your impression of us is truly important.", "We don't ever want to keep you waiting, Tim. Please check with our crew and they'll provide any available updates.", "On time flights are the plan, and reserve crew members are used whenever available.", "Not right now but we're working on it. One day all you'll have to do is think about booking an award and we'll get it done!", "Oh no! Please let a crew member know. Please DM your seat number and we'll make sure to get that taken care of.", "We're working hard to have our normal vendors and operations back as usual. Our apologies for any inconvenience this caused, Michael.", "Active duty military dependents are eligible for our military fares! Please call Reservations for details at 800-433-7300.", "Upgrades using 500 mile segments aren't available for award travel.", "She'll need to work with our Baggage team at the airport to have delivery set up.", "Enjoy your relaxation time and your flight to Philly!"], "34": ["We're glad we could help, have a great day!", "As previously mentioned, we have no plans on cancelling any flights as of now. You can set up notifications here: https://t.co/OtDaH7XmLN", "We're sorry for the inconvenience, Adam. Weights and balances are important to our pilots during flight.", "We do our best to always be competitive and appreciate your loyalty. Keep checking online for any fare sales that may come out.", "We have the best team in the business. Go", "We're sorry to hear that, Jared. So our team tried to reset the screens? Could you specify which seat you were sitting in?", "Schedule changes may occur based on operational needs. Please have them reach out to us or DM their record locator and we'll take a look.", "If you purchase a non-refundable ticket, there are charges for changes. Sometimes it is less to purchase a new ticket.", "Very nice! We're glad that they were able to do that and we hope that you guys had a wonderful Thanksgiving.", "FOod and beverage does help pass the time. We see your DM , and will reply back to you soon.", "We know delays aren't fun and we do our best to avoid them if we can. What's your flight number? We'll check the status.", "Safety is our top priority. We're taking a close look at this and will get back to you via DM.", "We're sorry for the late start yesterday, Jim. It looks like it was delay to to conditions at the airport.", "Memphis can't wait to see you! We'll be sure to pass along your thanks for Maryann.", "We're so sorry that you've been delayed, Christy. We'd be happy to take a look. Please meet us in DM with your record locator.", "It appears to be a bit of condensation there, Jeremy. Ask our crew members for a possible seat change."], "20": ["What's going on that has you feeling this way?", "Absolutely, that's the perfect way to start a trip!", "Our Lost and Found team would be in touch with you directly of any updates. Have they not? Please DM additional details.", "We see your DM, Lancy. We'll reply to your comments there.", "We're working hard to avoid all cancellations.", "We can check the fare rules on your ticket but we're unable to waive any of the charges. We'll take good care of you on your travel day.", "We're doing everything we can to avoid cancellations, but you can sign up to receive notifications here: https://t.co/OtDaH7XmLN", "We're sorry for any inconvenience and misinformation, but we'll see you back with us soon.", "We wouldn't mind taking a look at what happened. Send us your record locator via DMs, please.", "We see that you were affected by a schedule change however, we're not showing you requested a meal. Our apologies for any inconvenience.", "We have holiday hours for today. Are the hours posted there at the club?", "We're sure he just likes keeping you in the loop, Tara. Sit back, relax and enjoy the ride!", "We love the new Club look too and are glad you're enjoying your visit today, Lauren!", "We'd like to know more about this. Please DM your record locator and we'll look into this. Include any other details as well.", "They sound pretty tasty, Bryce. Thanks again for letting us know, we always like seeing our frequent flyers happy!", "We have the best team in the business! We'll be sure to pass along your compliment.", "We're always working to add great tools for our team to provide excellent service. Thanks for this feedback.", "We haven't heard back from our team, but as soon as we do we'll let you know.", "We certainly don't want to disappoint you. How can we help?"], "40": ["We'll be on our way as quickly as we can. If you send us a DM with your record locator, we'll take a closer look with you.", "We don't want to miss your connection, please DM your record locator if you need assistance rebooking.", "We'd love for you to check them out. But you'll need to travel on those flights to get them.", "We see our team has rebooked you to the next available flight tomorrow morning. Our sincerest apologies for the delay.", "We can look at a Same Day Flight Change via DM or you can see our airport team for standby.", "Confirming your flight won't hurt. You can go here to sign up for notifications just in case anything changes. https://t.co/h88H9iXqqT", "If you share more details with us via DM, we'd be happy to take a closer look.", "Kevin, we're glad to see you made your connection to your final destination. We're almost done boarding and should be pushing back soon.", "Rick, please DM your record locator so we can review your trip. Many of our specialists have contacted our customers with an email.", "Please meet us in DM, John. We'd like to review your reservation.", "We have it. You're very welcome.", "We do our best to always be on time and apologize for your delay, Kevin. What's your flight number?", "Please let us know what flight you're on, and we'll share your feedback with our IFE team.", "Please continue working with our airport agents for updates. The baggage agents will have the luggage offloaded shortly.", "It is a busy holiday season, and lines can be pretty long. We know it's disappointing to miss out on family time.", "Thanks for clarifying, we have your reservation here and have shared your comments with our leaders in Flight Service.", "Oh man, we're still dreaming of that turkey and pumpkin pie. Thanks for joining us on board!", "We're very sorry for the frustration this has caused you. If we can assist with rebooking, please DM your record locator.", "We're here to help. Send us the record locator and details about what happened.", "Weather can impact how much fuel is needed if we need to avoid the storm Our apologies for the delay.", "It's always available in the App Store. Just do a search for American Airlines and it should pop right up.", "We'll send your screenshot of the speed test to our team. Also, please let our folks there know.", "We'll have you in the air just as quickly as we can. Thanks for hanging in there with us.", "The return date on 10/23 is sold out. The next date available after that is on 10/28."], "81": ["Please file a claim with our Baggage Service Office, Stephanie. We'd like to get you reunited ASAP.", "When booking through our site there are several prompts when purchasing Basic Economy. https://t.co/MKvFFVWJdz", "We'd be happy to take a look at your reservation to make sure it's in correctly, please share your KTN and record locator via DM.", "Please follow and DM your record locator. We'd like to look into this more.", "You can sign up for flight status notification using the following link: https://t.co/h88H9iXqqT", "He's able to reuse his ticket for another trip within a year from the date of issue, but a change charge, plus fare difference will apply.", "We know how important the holidays are and fully expect to avoid cancellations, so we won't be offering refunds at this time.", "We appreciate you letting us know what happened at SMF. We depend on our customers feedback for an insight on how we're doing.", "We're working to resolve the issue, Mel. We haven't had to cancel any flights and expect to have all flights going during the holidays.", "Is it within 24 hours? DM your record locator and we'll check on your reservation.", "Seat changes may occur occasionally and it sounds like he may have a Basic Economy ticket. Please DM the record locator and we'll check.", "We'd like to review and dig a little deeper to see what happened on your son's flight. Please DM your record locator and any other details.", "We're working hard to get you on your way. Sorry for the delay tonight.", "What's going on Ray? Meet us in DM with more info.", "It's more fun to make up your own story as to why!", "Our mechanics are working behind the scenes to provide our gate team an update. We'll make an announcement shortly.", "Your comments and feedback is always taken seriously, Monica. We have your info and forwarded it for internal review.", "What's your flight number? We'd be happy to check the status.", "We know staying connected is important, why not take your office to 35k feet? We're so glad you're enjoying the WiFi!", "Our apologies for the hold. Our Central Baggage team will help at that number. If we can get an update, then please DM your bag file number."], "45": ["Bags need to be 50lbs or less, and under 62 linear inches. Anything heavier or larger will incur a oversize bag charge.", "We have you on your way now! We appreciate your patience today.", "We definitely don't want this to be your last trip with us and we'll have you in Mexico soon. We're following up in DM with more info.", "Very nice coastline shot of the city, Chris!", "We're operating schedules as normal. If any changes occur we'll let you know. But we fully expect to avoid cancelling flights.", "We're working on this and we expect a full operation. We're unable to refund your ticket if it's restricted.", "That's a pretty awesome window view, Matthew. Thanks for letting us take a peek!", "We're doing everything we can to maintain all flights. You can sign up for notifications here: https://t.co/h88H9iXqqT", "Yep! It's a fallstreak hole which is a large gap, usually circular or elliptical, that can appear in cirrocumulus or altocumulus clouds.", "We recommend deleting your tweet with the record locator for security purposes. We'll pass this info on to our team to review internally.", "Looks like a nice and sunshiny day to be flying into JFK!", "Our team in PHX is good and they'll help with all available options. If you need another eye, please DM us your record locator.", "Please have her work with our baggage team at the airport and they'll get her all set up."], "33": ["We'll get an update for you, what's your flight number?", "We have a flight leaving MSP at 4p connecting in PHL and arriving LHR at 7:45a. Would that work for you?", "We expect our crew members to always be courteous and and attentive, Arden. We're sorry that was overlooked.", "We'll be glad to review your trip as soon as you arrive at your final destination. Please follow us and meet us in DM.", "The remaining crew is coming in from a delayed flight. We're sorry for the extra wait time.", "We're very sorry for the wait, Michelle. What's your flight number, we'll check on an update?", "We love you too, Mikey!", "We're very sorry about that. Did you alert a crewmember?", "This is due to maintenance, if you send us your record locator via DM we can check on your connection.", "You can check the status of your bag delivery, John. Click here https://t.co/CWhl8tcyzH .", "We're happy to take a look for you, Darcy. Please meet us in DM with your record locator.", "We're sorry for the wait, KC. We always want to get you on your way on time.", "Our team's working hard to get you into the gate. We're so sorry for the inconvenience."], "76": ["We currently have an estimated departure time of 10:22a and should be in the air towards PHL shortly. Our apologies for the late start.", "We're very sorry for the wait and we so appreciate your understanding.", "Our offer to take a look via DM stands.", "We'd rather keep you flying with us, Nia. How can we help you today?", "We appreciate your loyalty and want to help if we can. What's going on?", "As of now, we aren't canceling any flights and expect to have the issue resolved prior to holiday travel.", "We'll have you wheels up and on your way shortly, Erik.", "Our apologies for the delay in your travel plans. What's your flight number? We'd be happy to check on the status for you.", "Please follow-up with us via DM so we may take a closer look with you.", "Seamless travel is always our goal and we're sorry for any delay to their travels. Please have them reach out to us directly for assistance.", "We think you're pretty too, Amanda. Hope you had a great ThAAnksgiving.", "We hear your disappointment, Jess. Turkey is a must for many on the Thanksgiving holiday.", "We're sorry for the delays but if there's anything we can do to help, please send us a DM with your record locator.", "We only charge for Premium seats, Adam. You're more than welcome to wait until the day of travel and any remaining ones will be free.", "Yes, travel agents are aware of the fare rules. You can check with them about about a buyout option to the regular fare.", "Your comments concern us, service animals are welcome on board if they meet requirements. Please DM some additional details.", "We're very sorry for the mix up and for the inconvenience, but we'll get it to you as quickly as possible.", "Our apologies that you haven't had a response yet. We'll look into this further and get back to you via DM soon.", "We're so sorry for the delay and we know our team is doing everything possible to minimize it. We'll have you in the air soon.", "We know how important it is to stay current, Leslie. We're always adding new additions to our fleet and technology. https://t.co/Cqtk8kHZip", "We do our best! Our team looks forward to the many we'll share together."], "72": ["This is a restriction you agree upon when booking Basic Economy. You're welcome to see more info here: https://t.co/MKvFFVWJdz", "We're sorry to hear that has been your experience, Alanna. Please let us know if we can help in some way.", "The baggage charges would apply to each direction you travel. We're sorry that you weren't aware of that.", "We'll pass along your kudos to Thomas!", "We do our best to clear as many upgrades as we can, send us a DM with the reservation you're referring to and we'll take a look.", "We strive to provide excellent service, Brian and regret hearing your son isn't able to travel. We're here to help, if needed.", "We'd like a bit more info, please share them with a screenshot via DM.", "Give our Web Services team a call at 800-222-2377 and they can walk you through setting up your password.", "We're sorry to hear that you haven't received your bag. You can view the delivery status via https://t.co/CWhl8tcyzH.", "Correct, if you have a business class reservation, or are an elite level AAdvantage member, the bag costs are generally waived.", "We know this situation is never easy and we're sorry for the inconvenience. We'll have you back in the air as soon as possible.", "Anything for you, Rina! See you soon.", "You can take a look at the travel alert guidelines here: https://t.co/kNkPUilgez", "Sorry you're not comfy on board, Anthony. Please feel free to check with a crewmember about switching seats."], "70": ["We'll have you on your way ASAP, what's your flight number?", "We'd be glad to review your trip details as soon as you land at your final destination. Please follow us and provide your locator via DM.", "We always want you to have an excellent experience when you fly with us and appreciate your feedback.", "If your friend needs to speak with someone regarding this, please have them speak with our airport team.", "We're sorry that they're not working. Please let our crew know and then we'll also pass this along to our Maintenance team.", "It's upsetting to miss final boarding, we understand. Please work with our gate team for the next available flight to your destination.", "This can be frustrating, we know. We've already escalated this to the highest and appropriate team. We'll update you as soon as possible.", "We're working hard to include power on every flight. For future our standard fares do allow for seats to be booked at the time of ticketing.", "Oh no, we were doing our happy dance for you, but we'll stop for a moment and look for another flight.", "We allow for unlimited changes to the dates and times if you'd like to rebook for new dates. Thanks for your feedback.", "We have limited service at this time to STT which are full. Please check back as availability of flights can change.", "Flight 3513 hasn't departed yet, did this happen on another day?", "We do all possible to avoid cancellations. Please continue to work with our team at the airport for available options.", "We're sorry to hear that happened. Please DM her record locator, share if she let a crew member know and provide the seat number.", "We're not seeing a delay today on 2286. Let us know if you need us to check on another flight. We see 5761 was cancelled due to weather.", "Our planes are cleaned in between every flight, Mirza. We'll pass this information on to our team.", "Your feedback is greatly appreciated, Duane. We'll pass your comments along to our team.", "We sure can, please send your record locator and KTN in a DM."], "48": ["We love hearing that Michelle is really knocking it out of the park today and taking excellent care of everyone.", "We're so sorry you had a rough start this morning! Can you please follow and DM us? We have some info we'd like to share.", "We appreciate your patience while one of our specialists reviews this.", "We aren't expecting any cancellations during the holiday season. If that changes though, we'll be sure to notify you, Caroline.", "We always want you to be comfy, Shawn! Sit back, relax and enjoy.", "Sharon is truly one of a kind and yet again this goes to prove how she is. We'll be sure to pass your kudos along.", "We're glad to see you're off and on your way now, our apologies for the extended wait and travel time.", "We're here to help. Please DM with your record locator and let us know what's going on.", "You can request an airport supervisor when you reach your destination, Tim.", "Please file a claim with our baggage team so we can look into this. https://t.co/zSdeH87Yqc", "Our team is always expected to be courteous and respectful. Our apologies.", "Additional questions may be asked when bringing along extra items. Our apologies for any frustration. This feedback has been sent on.", "Our sincere apologies, Will. We always want each member of our team to help whenever possible, and we appreciate your feedback.", "It sounds like you purchased a Basic Economy fare which allows one personal item on board. Please DM your locator and we'll take a look.", "We're going to look into this further! Please give us a quick follow so we can DM you more info."], "35": ["We know your time is valuable and apologize for the delay. We're finishing up preparing for departure and will be airborne soon!", "A refund was sent for the online change to Main Cabin. We'd need to collect the difference to go back to Premium Economy.", "We truly appreciate your patience and cooperation.", "Please follow and DM your record locator once your flight has completed. We'll take a look at your reservation.", "We're taking a closer look into this delay. Please give a quick follow so we can DM some info.", "Please continue working with our specialists in AAdvantage Customer Service. They'll do their best to provide more info.", "Oh, please file a report with our Baggage team at the airport. They'll physically assess any damages done to your bag.", "We appreciate your patience and understanding while our team continues to work on this.", "Sorry for the frustration. Have a great flight!", "We expect our team to be professional and courteous at all times and we're truly sorry for any rudeness.", "We're sorry for the delay. If you need help getting rebooked, DM your record locator.", "If you send us a DM with your record locator, we'll take a closer look with you.", "Online check-in is working. Please DM your record locator and we'll check on your reservation.", "Oh, my. What happened?", "We're not able to reimburse car rentals. Please DM your record locator.", "We're a virtual team, Monica. We're unable to call you. You can meet us in DM or contact Reservations at 800-433-7300."], "32": ["Awesome to hear. We love it when the makes your travel experience the best ever!", "A reservation will need to be added for you pup, we can help with that. Here's link with more info about documents: https://t.co/c1YOFtZqfR", "We've received and have responded to your DM.", "Karen, we don't require you to pay for seats, your ticket alone is enough. We'll assign you a seat at the gate if there are none available.", "We count on our team to provide stellar customer service to all our customer, Pete. We're sorry we missed the mark.", "We're sorry to disappoint you, Peter. We're always wanting to provide you with the best technology available. Please let a crew member know.", "We appreciate your feedback on this, Bill. You're welcome to select your seats anytime prior to check-in as well.", "Please check-in for the flights you can and then the agents at the airport will print out the remaining boarding passes for the others.", "We're sorry for your delay, Brenda. Please follow and meet us in DMs with your record locator and we'll look at available options.", "Please give us a follow and we'll send you a direct message. This is for his privacy, so we can discuss the particulars about his trip.", "Keep checking online for that, you never know! Sometimes it happens but no way of knowing for sure at this time.", "Great! Someone will take a look and reach back out to you.", "We love hearing you had such a fun trip and your kudos to the flight attendant is very much appreciated!"], "57": ["We're glad our team came through and resolve it. The only time there would be a charge is if you had a Basic Economy ticket.", "Basic Economy offers lower fares and only one small carry-on. Regular fares offer one carry-on that fits in the bin, plus a personal item.", "Once the plane is in the air and at cruising altitude, ask the crew if you can move. You may be asked to move back upon landing.", "Keep an eye on all the fares we have to offer here: https://t.co/iJWiiS4WLg", "We hear you and our agents will be sure to provide updates as information comes in.", "The type of ticket, route, elite status, etc. determine what's included in your reservation and seats become available at the airport.", "If the First Class fare is refundable, we can provide the difference, but if it's nonrefundable, we're unable to provide any credits.", "Our agents will request to gate check your bag to avoid delays in boarding. We're sorry for the inconvenience, Aaron.", "You're very welcome and our hearts and prayers are with you all.", "You sound frustrated today. Please let us know how we can assist.", "What's going on that has you feeling this way?", "Our agents watch all bags. Personal items include a purse, or small backpack. Bigger bags are considered carry-on and must be checked.", "It should have been made very clear if booked through us on our website. It's usually less than our advance purchased fares.", "We're sorry if you were uncomfortable, and appreciate your kind words! We'll send them over to the pilots."], "64": ["We're not always able to hold flights. Our airport team knows you're coming, and will do all possible to help you make your flight.", "You could always click here to see what's available during your flight, Chris. https://t.co/RcjsILm7Rc", "We're sorry for this. If you're not traveling and we can help with a refund, then please DM your record locator.", "We're working to resolve the issue and expect to avoid cancellations this holiday season.", "As of now, no flights are being affected. We should have a resolution and will avoid any cancellations during holiday travel.", "Our apologies for any misunderstanding. We're always going for consistency including our bag dimension guidelines.", "We want to get you reunited, had you filed a claim with our Lost and Found team? https://t.co/JsEGHYNki5 Please follow-up via DM.", "We're more than happy to check options for you. DM your record locator if you'd like.", "We understand and we're very sorry if we aren't able to get you to your plans on time today.", "We always want to get you in the air right on time, Darcy. We're sorry for the wait today.", "Sorry for the wait tonight. We always want to get you on your way as quickly as possible."], "43": ["This isn't what we want to hear, what's going on?", "We see that the departure wasn't taken and not canceled prior to the flight. Due to this your ticket is no longer valid.", "You can use your voucher towards the ticket and purchase the difference, Bill. Please contact Reservations at 800-433-7300. They can help.", "We plan on operating as usual and expect to avoid any cancellations.", "You can go to the following link: https://t.co/xM8Vkc7BvM Click on request a receipt and enter the ticket number.", "All seats become free on the day of travel and you can speak with the gate agent to go over availability.", "Our apologies for the late start today. Once you arrive to your destination reach back out to us here and we'll review further.", "Sure you can! Just give us a call here: https://t.co/Y3rvFiW5bQ", "We'd like to get you the most accurate information, please DM your record locator, and we'll take a look.", "We're sorry to hear that. Please work with our team at the airport if you need any help getting rebooked.", "Since they're a minor, you'll need to book through our Reservations team and there is no booking charge."], "13": ["As shared at check-in and purchase, you're not able to bring a carry-on. If you gate check it, then an extra $25 is added.", "Our team is always happy to provide great service and help as much as we can. What's going that has you feeling otherwise?", "What's going on and how can we help? Please share more details with us via DM.", "There's a lot to see when you're flying the skies. Thanks for joining us this morning!", "We don't want you feeling this way, Kathy. How can we help?", "Flights haven't been canceled, Scotty. We're resolving the issue and fully expect to fly during the holiday season.", "You've been busy up there, Dave! You captured some great shots.", "Under Print trip and receipt, scroll to the bottom under endorsements and restrictions. Your ticket is non-refundable with a fee for changes", "Yes, if your bag is gate checked we send it to the baggage claim at your final destination.", "Our apologies for the delays, Hank. We'll have you headed out as soon as we can.", "We've responded. Please check your DM.", "We do offer evouchers as well but in some instances we still need to issue paper vouchers. Thanks for understanding.", "Hi Larry! Click on the App tab here https://t.co/mzNUau3TZq and that should do the trick.", "We're sorry to hear that your flight was delayed. We try really hard for this not to happen.", "We're happy this has been resolved, Ashley!"], "9": ["Boarding passes aren't issued until you check-in 24 hrs. of your flight.", "We know how important the holidays are and fully expect to avoid cancellations during this time, Kristen.", "We're working hard to address the issue and expect to avoid cancellations this holiday season.", "Give our team a call at 800-882-8880 and they'll be happy to look into this with you!", "We use a group boarding process that recognizes class of service and elite status first. We appreciate your feedback though WILLY.", "We apologize for the delay while we awaited clearance, Eric. Thanks a lot for hanging in there with our crew.", "We always want your flight to be pleasant so feel free to speak with an attendant and they may be able to find another open seat for you.", "Jenna, we're here to help. Please DM your record locator and we'll take a look at your connection.", "Please have a crew member take a look at the display. Enjoy your flight, Damaso.", "If you book more than 21 days out you can avoid this charge. You can read more about our awards here: https://t.co/oYZQG4b6qn", "Absolutely stunning! We're loving this and it's great to have you on board with us today.", "Group 9 is for those traveling Basic Economy which does not come with overhead bin access. https://t.co/MKvFFVWJdz", "We do have a few birds that like to make their nest at DFW when not flying you awAAy to amazing places, Loren!", "We're sorry for the extra wait time, Marc. We'll be getting you deplaned as soon as possible."]}